{
  "data": {
    "leaf": [
      {
        "Id": 1,
        "Scientific_Name": "Artocarpus heterophyllus Lam",
        "Common_Name": "Jackfruit, Panasa",
        "Family": "Moraceae",
        "Leaf_Shape": "Obovate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "Jackfruit trees typically reach a height of 8 to 25 m and a canopy diameter of 3.5 to 6.7 m at 5 years of age. They grow well in equatorial to subtropical maritime climates at elevations of 1 to 1600 m with average rainfall of 100 to 240 cm. Growth is moderately rapid in early years, up to 1.5 m in height per year, but slows to around 0.5 m per year as trees reach maturity. Typical fruit yield is around 70 to 100 kg per tree per year.",
        "Utility": "The wood of Jackfruit, which ages to an orange or red-brown color, is highly durable, resisting termites and decay. A yellow dye is sometimes extracted from the wood and used for dyeing clothes, especially in India and the Far East.",
        "Common_diseases_and_Pests": "Leaf spot, Root rot"
      },
      {
        "Id": 2,
        "Scientific_Name": "Neolamarckia cadamba",
        "Common_Name": "Kadamba, Burflower-tree, Laran, Leichhardt pine",
        "Family": "Rubiaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "A fully mature kadam tree can reach up to 45 m in height. It is a large tree with a broad crown and straight cylindrical bole. It is quick growing, with broad spreading branches and grows rapidly in the first 6–8 years. The trunk has a diameter of 100–160 cm, but typically less than that. Leaves are 13–32 cm long. Flowering usually begins when the tree is 4–5 years old. Kadam flowers are sweetly fragrant, red to orange in colour, occurring in dense, globular heads of approximately 5.5 cm diameter. The fruit of N. cadamba occur in small, fleshy capsules packed closely together to form a fleshy yellow-orange infructescence containing approximately 8000 seeds. On maturing, the fruit splits apart, releasing the seeds, which are then dispersed by wind or rain.",
        "Utility": "Kadamba is one of the most frequently planted trees in the tropics. The tree is grown along avenues, roadsides and villages for shade. Kadamba are suitable for reforestation programs. It sheds large amounts of leaf and non-leaf litter which on decomposition improves some physical and chemical properties of soil under its canopy. A yellow dye is obtained from the root bark. Kadamba flowers are an important raw material in the production of ‘attar’, which is Indian perfume with sandalwood  base in which one of the essences is absorbed through hydro-distillation. An extract of the leaves serves as a mouth gargle.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 3,
        "Scientific_Name": "Bauhinia variegata",
        "Common_Name": "Kanchanara",
        "Family": "Fabaceae",
        "Leaf_Shape": "Obcordate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "It is a small to medium-sized tree growing to 10–12 metres  tall, deciduous in the dry season. The leaves are 10–20 centimetres obcordate shaped, long and broad, rounded, and bilobed at the base and apex. The flowers are conspicuous, bright pink or white, 8–12 centimetres  diameter, with five petals. The fruit is a pod 15–30 centimetres  long, containing several seeds.",
        "Utility": "Kachnar is widely used as an ingredient in many Pakistani and Indian recipes. Traditional kachnar curry is prepared using kachnar buds, yogurt, onions and native Pakistani and Indian spices. In Rawalpindi, Pakistan Kachnar is cooked with minced beef.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 4,
        "Scientific_Name": "Mimusops elengi",
        "Common_Name": "Bakul, Spanish cherry, Medlar, Bullet wood",
        "Family": "Sapotaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "Bullet wood is an evergreen tree reaching a height of about 16 m. It flowers in April, and fruiting occurs in June. Leaves are glossy, dark green, oval-shaped, 5–14 cm long, and 2.5–6 cm wide. Flowers are cream, hairy, and scented. Bark is thick and appears dark brownish black or grayish black in colour, with striations and a few cracks on the surface. The tree may reach up to a height of 9–18 m  with about 1 m  in circumference.",
        "Utility": "The bark, flowers, fruits, and seeds of Bakula are used in Ayurvedic medicine in which it is purported to be astringent, cooling, anthelmintic, tonic, and febrifuge. It is mainly used for dental ailments such as bleeding gums, pyorrhea, dental caries, and loose teeth. The wood is a luxurious wood that is extremely hard, strong and tough, and rich deep red in color. The heart wood is sharply defined from the sapwood. It works easily and takes a beautiful polish",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 5,
        "Scientific_Name": "Plumeria obtusa",
        "Common_Name": "Plumeria",
        "Family": "Apocynaceae",
        "Leaf_Shape": "Obovate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "\"White Frangipani can grow as either a small shrub or tree ranging in height from 0.9-6.1 m with widely spaced thick succulent branches that are often covered with \"\"knobby\"\" protuberances. The leaves are\tclustered near the tips of the branches. They are large, 6-22 cm long, 2-7 cm wide, and have a characteristic obovate shape and the tip of the leaf is rounded, rather than pointed as it is in other species. The leaves are dark and leathery and tend to be shiny on the upper surface with conspicuous parallel secondary veins that run from the midvein to the margins of the leaves. The flowers of this species are borne in clusters that form at the ends of the branches on a long thick stalk. Each inflorescence contains many white flowers with a small yellow center. Flowers contain five petals that are fused at the base in a short funnel-shaped tube which gradually widens as the lobes of the petals are spread out. The fruit of this species is a dry follicle which splits along one side to release the winged seeds. Plumeria obtusa is native to the Bahamas and the Greater Antilles in Central America. It is widely cultivated in tropical climates including eastern Africa, Asia.\"",
        "Utility": "This plant is commonly used as an ornamental, grown for its flowers. In Cambodia the flowers are used to make necklaces and in offerings to the deities. In traditional medicine used in that country, a decoction of the bark is given in varying doses as a purgative or as a remedy against oedemas.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 6,
        "Scientific_Name": "Euphorbia milii",
        "Common_Name": "crown of thorns, Christ plant, Christ thorn",
        "Family": "Euphorbiaceae",
        "Leaf_Shape": "Obovate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "It is a succulent climbing shrub growing to 1.8 m tall, with densely spiny stems. The straight, slender spines, up to 3 cm long, help it scramble over other plants. The leaves are found mainly on new growth, and are obovate, up to 3.5 cm long and 1.5 cm broad. The flowers are small, subtended by a pair of conspicuous petal-like bracts, variably red, pink or white, up to 12 mm broad. The sap is moderately poisonous, and causes irritation on contact with skin or eyes. If ingested, it causes severe stomach pain, irritation of the throat and mouth, and vomiting. The poisonous ingredients have been identified as phorbol esters. Wat Phrik in Thailand claims to be the home of the world's tallest Christ thorn plant.",
        "Utility": "E. milii is a variable species, and several varieties have been described; some of these are treated as distinct species by some authors. E. milii var. splendens (syn. E. splendens) is considered to be the living embodiment of the supreme deity in Bathouism, a minority religion practiced by the Bodo people of Eastern India and Nepal.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 7,
        "Scientific_Name": "Catharanthus roseus",
        "Common_Name": "Periwinkle,  Rose periwinkle, Cape periwinkle, Old-maid",
        "Family": "Apocynaceae",
        "Leaf_Shape": "Oblong",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "It is an evergreen subshrub or herbaceous plant growing 1 m tall. The leaves are oval to oblong, 2.5–9 cm long and 1–3.5 cm broad, glossy green, hairless, with a pale midrib and a short petiole 1–1.8 cm long; they are arranged in opposite pairs. The flowers are white to dark pink with a darker red centre, with a basal tube 2.5–3 cm long and a corolla 2–5 cm diameter with five petal-like lobes. The fruit is a pair of follicles 2–4 cm long and 3 mm broad.",
        "Utility": "The species has long been cultivated for herbal medicine and as an ornamental plant. In the UK it has gained the Royal Horticultural Society’s Award of Garden Merit (confirmed 2017). In Ayurveda (Indian traditional medicine) the extracts of its roots and shoots, though poisonous, are used against several diseases. In traditional Chinese medicine, extracts from it have been used against numerous diseases, including diabetes, malaria, and Hodgkin's lymphoma. Many of the vinca alkaloids were first isolated from Catharanthus roseus, including vinblastine and vincristine used in the treatment of leukemia and Hodgkin's lymphoma.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 8,
        "Scientific_Name": "Darmera peltata",
        "Common_Name": "Indian Rhubarb",
        "Family": "Saxifragaceae",
        "Leaf_Shape": "Peltate",
        "Leaf_margin_edge": "Crenate",
        "Leaf_Division": "Simple",
        "Description": "\"Darmera peltata (Indian rhubarb or umbrella plant) is a flowering plant, the only species within the genus Darmera in the family Saxifragaceae. It is a slowly spreading rhizomatous perennial native to mountain streamsides in woodland in the western United States (southwestern Oregon to northwestern California), growing to 2 m tall by 1 m wide. The name Darmera comes after Karl Darmer, a Berlin horticulturist from 19th century.\n\nIn late spring the flowers emerge before the leaves, with rounded cymes of numerous five-petalled white to bright pink flowers (measuring up to 1.5 cm across each) borne on flower stems up to 2m long. The leaves are peltate, rounded, deeply lobed, coarsely toothed, conspicuously veined and dark green, also on stems up to 2m in height. The leaves turn red in autumn.\"",
        "Utility": "This native of the western U.S. is found growing along woodland stream banks, and helps to add a tropical look to temperate gardens. Darmera makes a distinct and long-lasting foliage statement in moist conditions, and exhibits autumn color also.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 9,
        "Scientific_Name": "Hibiscus rosa-sinensis L.",
        "Common_Name": "Hibiscus, Mandaaram",
        "Family": "Malvaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Serrate",
        "Leaf_Division": "Simple",
        "Description": "Hibiscus rosa-sinensis is a bushy, evergreen shrub or small tree growing 2.5–5 m tall and 1.5–3 m wide, with glossy leaves and solitary, brilliant red flowers in summer and autumn. The 5-petaled flowers are 10 cm in diameter, with prominent orange-tipped red anthers.",
        "Utility": "The flowers of Hibiscus rosa-sinensis are edible and are used in salads in the Pacific Islands. The flower is additionally used in hair care as a preparation. It is also used to shine shoes in certain parts of India. It can also be used as a pH indicator. When used, the flower turns acidic solutions to a dark pink or magenta color and basic solutions to green.In Indonesia, these flowers are called &quot;kembang sepatu&quot;, which literally means &quot;shoe flower&quot;. In several countries the flowers are dried to use in a beverage, usually tea.",
        "Common_diseases_and_Pests": "Leaf spot"
      },
      {
        "Id": 10,
        "Scientific_Name": "Rosa kordesii",
        "Common_Name": "Rose",
        "Family": "Rosaceae",
        "Leaf_Shape": "Cordate",
        "Leaf_margin_edge": "Serrate",
        "Leaf_Division": "Simple",
        "Description": "Rosa kordesii, or Rosa × kordesii is a type of rose that arose naturally from hybridization followed by chromosome doubling. Rosa kordesii 'L 15', one of several garden roses produced with the same parentage. This rose produced a few viable seeds as a result of self-pollination, and the seedlings that resulted were tetraploid instead of diploid, i.e., the chromosomes of both pollen and egg cells had been naturally duplicated.",
        "Utility": "Amphidiploid roses including Rosa kordesii have been used to some degree in breeding programs in combination with naturally occurring tetraploid roses",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 11,
        "Scientific_Name": "Annona squamosa L.",
        "Common_Name": "Custard apple, seethaphalam",
        "Family": "Annonaceae",
        "Leaf_Shape": "Oblanceolate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "This is a small, well-branched tree or shrub that bears edible fruits called custard apple. This is a small, deciduous much branched shrub or small tree around 3 metres with a broad, open crown or irregularly spreading branches and a short trunk short. Propagation is through seeds. Custard Apple is native to the tropical Americas and West Indies. It tolerates a tropical lowland climate helping make it the most widely cultivated. The fruit grows throughout the tropics and warmer subtropics.",
        "Utility": "In traditional medicine, the leaves are used in a decoction to treat dysentery and urinary tract infection. In traditional Indian medicine, they are also crushed and applied to wounds."
      },
      {
        "Id": 12,
        "Scientific_Name": "Kigelia africana",
        "Common_Name": "Sausage tree, Cucumber tree, Hathi bailan;",
        "Family": "Bignoniaceae",
        "Leaf_Shape": "Oblong",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Compound",
        "Description": "The blood-red flowers of the sausage tree bloom at night on long, ropelike stalks that hang down from the limbs of this tropical tree. The fragrant, nectar-rich blossoms are pollinated by bats, insects and sunbirds in their native habitat. The mature fruits dangle from the long stalks like giant sausages. They may be up to two feet long and weigh up to 6.8 kg. The flowers are seen hanging from the tree while they haven't opened. After they open, they fall off quite soon. The fruit, while not palatable for humans, is popular with hippos, baboons, and giraffes. Mainly grown as a curiosity and ornamental, both for its beautiful deep red flowers and its strange fruit.",
        "Utility": "\"The fresh fruit is poisonous and strongly purgative; fruit are prepared for consumption by drying, roasting or fermentation (Joffe 2003; McBurney 2004). In central Kenya, the dried fruits are used to make an alcoholic beverage called Muratina which is a core components in cultural events in Central Kenya. Kigelia is also used in a number of skin care products. In Botswana, the timber is used for makoros, yokes and oars (Roodt 1992).\n\nThe tree is widely grown as an ornamental tree in tropical regions for its decorative flowers and unusual fruit. Planting sites should be selected carefully, as the falling fruit can cause serious injury to people and damage vehicles parked under the trees.\"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 13,
        "Scientific_Name": "Carissa carandas",
        "Common_Name": "karanda, karamardaka, bengal currant, vakkaya",
        "Family": "Apocynaceae",
        "Leaf_Shape": "Oblong",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "The karanda is a sprawling semi-vine shrub native to India. Leaves are from one-and-a-half to two-and-a-half inches long, very dark green, shiny and opposite and they have large spines like many other Carissas. If the leaves or stems are injured, the white milky sap is seen, which is characteristic of this group of plants. Although carissa karanda can be kept clipped into a shrub, it really prefers to act much like a vine similar to bougainvillea and will climb to the tops of rather tall trees. Small fragrant three-quarter-inch white flowers, with rose stalk, are produced from early spring through late fall and the clusters of small purplish to black fruit ripen from May through October. Fruit size is variable, but most fruits are about three-quarters of an inch in diameter with a few seeds. Fruits usually occur in clusters somewhat resembling large purple grapes.",
        "Utility": "\"The fruit is a rich source of iron, so it sometimes used in treatment of anaemia. It contains a fair amount of Vitamin C and therefore is an antiscorbutic.\n\nMature fruit is harvested for pickles. It contains pectin and accordingly is a useful ingredient in jelly, jam, syrup and chutney. Ripe fruits exude a white latex when severed from the branch.\n\nThe roots of the plant are heavily branched, making it valuable for stabilizing eroding slopes.\"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 14,
        "Scientific_Name": "Tabernaemontana divaricata",
        "Common_Name": "Crape Jasmine, Nandivardhanam",
        "Family": "Apocynaceae",
        "Leaf_Shape": "Lanceolate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "The plant generally grows to a height of 1.5–1.8 m and is dichotomously-branched. The large shiny leaves are deep green and about 15 cm in length and 5.1 cm in width. The waxy blossoms are found in small clusters on the stem tips. The (single) flowers have the characteristic &apos;pinwheel&apos; shape also seen in other genera in the family Apocynaceae such as Vinca and Nerium. Both single and double-flowered forms are cultivated, the flowers of both forms being white. The plant blooms in spring but flowers appear sporadically all year. The flowers of the single form are unscented but the double-flowered form has a pleasing fragrance.",
        "Utility": "Native to tropical areas of India and is widely grown for its ornamental value in frost-free areas around the world. The roots are used in Ayurvedic medicine as an anthelmintic for ascariasis and a treatment for scabies. The young stems are also good for the teeth, the latex being applied, on a cotton pellet, to teeth with dental caries.\n\nIn mainland South East Asia an infusion of the roots is used as an antipyretic. In the Malay Peninsula a sweetened infusion of the leaves is used as a cough medicine. In Indonesia a decoction is used as an astringent anti-diarrhoeal. On Ambon Island the root is used to treat internal poisoning,  kidney stones and (in combination with two other plants) lumbago. On the Mentawai Islands, west of Sumatra, the latex is one of the ingredients in an arrow poison.",
        "Common_diseases_and_Pests": "Leaf spot, Root rot"
      },
      {
        "Id": 15,
        "Scientific_Name": "Polyalthia longifolia",
        "Common_Name": "Indian willow, Ashoka chettu, Devdaru",
        "Family": "Annonaceae",
        "Leaf_Shape": "Lanceolate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "Polyalthia longifolia, the Ashoka native to India, is a lofty evergreen tree, commonly planted due to its effectiveness in alleviating noise pollution. It exhibits symmetrical pyramidal growth with willowy weeping pendulous branches and long narrow lanceolate leaves with undulate margins. The tree is known to grow over 10m in height.",
        "Utility": "The leaves are used for ornamental decoration during festivals. The tree is a main attraction in gardens throughout India. The tree can be cut into various shapes and maintained in required sizes. In past, the flexible, straight and light-weight trunks were used in the making of masts for sailing ships. That is why the tree is also known as the Mast Tree.",
        "Common_diseases_and_Pests": "Leaf spot"
      },
      {
        "Id": 16,
        "Scientific_Name": "Manilkara zapota",
        "Common_Name": "Sapota, Chikoo, sapodill",
        "Family": "sapotaceae",
        "Leaf_Shape": "Elliptical",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "Sapodilla can grow to more than 30 m (98 ft) tall with an average trunk diameter of 1.5 m (4.9 ft). The average height of cultivated specimens, however, is usually between 9 and 15 m (30 and 49 ft) with a trunk diameter not exceeding 50 cm (20 in). It is wind-resistant and the bark is rich in a white, gummy latex called chicle.\nThe fruit is a large berry, 4–8 cm (1.6–3.1 in) in diameter. Inside, its flesh ranges from a pale yellow to an earthy brown color with a grainy texture akin to that of a well-ripened pear. Each fruit contains one to six seeds. The seeds are hard, glossy, and black, resembling beans, with a hook at one end that can catch in the throat if swallowed.",
        "Utility": "This is commonly grown for it&apos;s fruits. The fruit has an exceptionally sweet, malty flavor. The unripe fruit is hard to the touch and contains high amounts of saponin, which has astringent properties similar to tannin, drying out the mouth.\n\nCompounds extracted from the leaves showed anti-diabetic, antioxidant and hypocholesterolemic (cholesterol-lowering) effects in rats. Acetone extracts of the seeds exhibited in vitro antibacterial effects against strains of Pseudomonas oleovorans and Vibrio cholerae.",
        "Common_diseases_and_Pests": "Common disease include Leaf Spot, Sooty Mould, Flat Leaf/Fasciation"
      },
      {
        "Id": 17,
        "Scientific_Name": "Citrus limon (L.) Osbeck",
        "Common_Name": "Lemon, Nimma",
        "Family": "Rutaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Crenate",
        "Leaf_Division": "Simple",
        "Description": "\"The true lemon tree reaches 3-6 m in height and usually has sharp thorns on the twigs. The alternate leaves, reddish when young, become dark-green above, light-green below; are oblong, elliptic or long-ovate, 6.25-11.25 cm long, finely toothed, with slender wings on the petioles. The mildly fragrant flowers may be solitary or there may be 2 or more clustered in the leaf axils. Buds are reddish; the opened flowers have 4 or 5 petals 2 cm long, white on the upper surface (inside), purplish beneath (outside), and 20-40 more or less united stamens with yellow anthers. The fruit is oval with a nipple-like protuberance at the apex; 7 -12 cm long; the peel is usually light-yellow though some lemons are variegated with longitudinal stripes of green and yellow or white; it is aromatic, dotted with oil glands; 6-10 mm thick; pulp is pale-yellow, in 8 to 10 segments, juicy, acid. Some fruits are seedless, most have a few seeds, elliptic or ovate, pointed, smooth, 9.5 mm long, white inside.\n\n\"",
        "Utility": "The tree's ellipsoidal yellow fruit is used for culinary and non-culinary purposes throughout the world, primarily for its juice, which has both culinary and cleaning uses. The pulp and rind (zest) are also used in cooking and baking. The juice of the lemon is about 5% to 6% citric acid, with a pH of around 2.2, giving it a sour taste. The distinctive sour taste of lemon juice makes it a key ingredient in drinks and foods such as lemonade and lemon meringue pie.",
        "Common_diseases_and_Pests": "Scab, Anthracnose, Greasy spot, Gummosis"
      },
      {
        "Id": 18,
        "Scientific_Name": "Citrus limetta",
        "Common_Name": "Sweet lime, Mosambi, battayi",
        "Family": "Rutaceae",
        "Leaf_Division": "Compound",
        "Description": "C. limetta is a small tree up to 8 m (26 ft) in height, with irregular branches and relatively smooth, brownish-grey bark. It has numerous thorns, 1.5–7.5 cm (0.59–2.95 in) long. The petioles are narrowly but distinctly winged, and are 8–29 mm (0.31–1.14 in) long. Leaves are compound, with acuminate leaflets 5–17 cm (2.0–6.7 in) long and 2.8–8 cm (1.1–3.1 in) wide. Flowers are white, 2–3 cm (0.79–1.18 in) wide. Fruits are oval and green, ripening to yellow, with greenish pulp. The pith is white and about 5 mm (0.20 in) thick. Despite the name sweet lime, the fruit is more similar to a greenish orange in appearance. C. limetta grows in tropical and subtropical climates. It begins bearing fruit at 5 to 7 years old, with peak production at 10 to 20 years. It is propagated by seed.",
        "Utility": "Sweet lime is almost exclusively served as juice, and is the most common available citrus juice in India, Pakistan and Bangladesh. Like most citrus, the fruit is rich in vitamin C, providing 50 mg per 100 g serving. In Iran it is used to treat influenza and common cold."
      },
      {
        "Id": 19,
        "Scientific_Name": "Psidium guajava L.",
        "Common_Name": "Common gauva",
        "Family": "Myrtaceae",
        "Leaf_Shape": "Elliptical",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "The most frequently eaten species, and the one often simply referred to as &quot;the guava&quot;, is the apple guava (Psidium guajava). Guavas are typical Myrtoideae, with tough dark leaves that are opposite, simple, elliptic to ovate and 5–15 centimetres (2.0–5.9 in) long. The flowers are white, with five petals and numerous stamens. The fruits are many-seeded berries.",
        "Utility": "Guavas are rich in dietary fiber and vitamin C, with moderate levels of folic acid. Having a generally broad, low-calorie profile of essential nutrients, a single common guava (P. guajava) fruit contains about four times the amount of vitamin C as an orange.\nIn many countries, guava is eaten raw, typically cut into quarters or eaten like an apple. Possibly used for culinary or cosmetics products, guava seed oil is a source of beta carotene, vitamin A, vitamin C, copper, zinc and selenium.",
        "Common_diseases_and_Pests": "Wilt, Anthracnose, Cercospora Leaf Spot, Scab"
      },
      {
        "Id": 20,
        "Scientific_Name": "Crossandra infundibuliformis (L.) Nees",
        "Common_Name": "firecracker flower, kanakambaram",
        "Family": "Acanthaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "It is an erect, evergreen subshrub growing to 1 m (3 ft 3 in) with glossy, wavy-margined leaves and fan-shaped flowers, which may appear at any time throughout the year. The flowers are unusually shaped with 3 to 5 asymmetrical petals. They grow from four-sided stalked spikes, and have a tube-like ¾ inch stalk. Flower colours range from the common orange to salmon-orange or apricot, coral to red, yellow and even turquoise.",
        "Utility": "The tiny flowers are often strung together into strands, sometimes along with white jasmine flowers and therefore in great demand for making garlands which are offered to temple deities or used to embellish women’s hair.",
        "Common_diseases_and_Pests": "Collar Rot disease"
      },
      {
        "Id": 21,
        "Scientific_Name": "Tagetes erecta L.",
        "Common_Name": "Mexican marigold, Aztec marigold, African marigold, marigold, banthipuvvu",
        "Family": "Asteraceae",
        "Leaf_Shape": "Lanceolate",
        "Leaf_margin_edge": "Serrate",
        "Leaf_Division": "Simple",
        "Description": "This plant reaches heights of between 50 and 100 cm (20 and 39 in). The Aztecs gathered the wild plant as well as cultivating it for medicinal, ceremonial and decorative purposes. It is widely cultivated commercially with many cultivars in use as ornamental plants, and for the cut-flower trade.[",
        "Utility": "Marigold may help protect certain crop plants from nematode pests when planted in fields. The flower is still commonly planted in cemeteries and it has many other uses. The oil of the flower may be added to perfumes to infuse an apple scent into them. This is also grown to extract lutein, a common yellow/orange food colour (E161b).[",
        "Common_diseases_and_Pests": "Gray Mold, Aster Yellows"
      },
      {
        "Id": 22,
        "Scientific_Name": "Tamarindus Indica",
        "Common_Name": "Chintapandu, Tamarind, Imli",
        "Family": "Fabaceae",
        "Leaf_Shape": "Elliptical",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Compound",
        "Description": "The tamarind is a long-lived, medium-growth shrub, which attains a maximum crown height of 12 to 18 metres (39 to 59 ft). The crown has an irregular, vase-shaped outline of dense foliage. The tree grows well in full sun in clay, loam, sandy, and acidic soil types, with a high resistance to drought and aerosol salt (wind-borne salt as found in coastal areas). The evergreen leaves are alternately arranged and pinnately compound. The leaflets are bright green, elliptical ovular, pinnately veined, and less than 5 cm (2.0 in) in length. The branches droop from a single, central trunk as the tree matures and is often pruned in agriculture to optimize tree density and ease of fruit harvest. At night, the leaflets close up.",
        "Utility": "Tamarind is used as food in various ways. The tender, immature, very sour pods are cooked as seasoning with rice, fish and meats in India. In native practice, the pulp is applied on inflammations, used in a gargle for sore throat and, mixed with salt, as a liniment for rheumatism. The flowers of Tamarind are considered a good source of nectar for honeybees in South India. The honey is golden-yellow and slightly acid in flavor. The oil extracted from the seeds is said to be palatable and have culinary quality. Tamarind seeds have been used in a limited way as emergency food. Throughout Asia and the tropical world, tamarind trees are used as ornamental, garden, and cash crop plantings. Commonly used as a bonsai species in many Asian countries, it is also grown as an indoor bonsai in temperate parts of the world.",
        "Common_diseases_and_Pests": "Sooty mold, bacterial leaf-spot"
      },
      {
        "Id": 23,
        "Scientific_Name": "Punica granatum L.",
        "Common_Name": "Pomegranate, Danimma, anaar",
        "Family": "Lythraceae",
        "Leaf_Shape": "Oblong",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "A shrub or small tree growing 6 to 10 m high, the pomegranate has multiple spiny branches and is extremely long-lived, with some specimens in France surviving for 200 years. P. granatum leaves are opposite or subopposite, glossy, narrow oblong, entire, 3–7 cm long and 2 cm broad. The flowers are bright red and 3 cm in diameter, with three to seven petals. Some fruitless varieties are grown for the flowers alone.",
        "Utility": "In India&apos;s ancient Ayurveda system of traditional medicine, the pomegranate is frequently described as an ingredient in remedies. A 100-g serving of pomegranate seeds provides 12% of the Daily Value (DV) for vitamin C, 16% DV for vitamin K and 10% DV for folate .",
        "Common_diseases_and_Pests": "Virachola isocrates, Leptoglossus zonatus"
      },
      {
        "Id": 24,
        "Scientific_Name": "Wrightia tinctoria R.BR",
        "Common_Name": "Ivory tree, Repala chettu",
        "Family": "Apocynaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "It is a small to medium-sized deciduous shrub or tree, ranging from 3 m to 15 m in height.The bark is smooth, yellowish-brown and about 10 mm thick, producing a milky-white latex. Leaves are simple, oppositely arranged, ovate, obtusely acuminate and are 10–20 cm long and 5 cm wide. Leaves are glabrous and sometimes pubescent beneath. Leaf stalks are very short. The flowers appear (in India) from March to May, peaking from April to June.",
        "Utility": "The leaves, flowers, fruits and roots is a sources of indigo-yielding glucoside, which produces a indigo like dye. The juice from fresh unripe fruits is used for coagulating milk. The leaves are used to relieve toothache when chewed with salt. Also the leaves and roots are pounded in water for treatment of fever. In Indian traditional medicine, the bark and leaves are used to treat psoriasis, stomach pains, toothache, and dysentery.",
        "Common_diseases_and_Pests": "Wrightia tinctoria"
      },
      {
        "Id": 25,
        "Scientific_Name": "Gliricidia sepium",
        "Common_Name": "Gliricidia",
        "Family": "Fabaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Compound",
        "Description": "Medium-sized tree that grows 10 to 12 meters high. The bark is smooth, and its color can range from a whitish gray to deep red-brown.It has composite leaves that can be 30 cm long. Each leaf is composed of leaflets that are about 2 to 7 cm long and 1 to 3 cm wide.The flowers are located on the end of branches that have no leaves. These flowers have a bright pink to lilac color that is tinged with white. A pale yellow spot is usually at the flower&apos;s base. The tree&apos;s fruit is a pod about 10 to 15 cm long. It is green when unripe and becomes yellow-brown when it reaches maturity. The pod produces 4 to 10 round brown seeds.",
        "Utility": "Few non-industrial tree species embody the concept of a multipurpose tree better than G. sepium. Throughout both its native and exotic ranges it is used to supply tree products such as fuelwood, construction poles, crop supports, green manure, fodder and bee forage. In addition, it is used in living fences, to stabilise soils and prevent erosion, to shade plantation crops, as an ornamental and in traditional medicine for eczema. Generally, however, it is cultivated for a particular purpose and the additional benefits are appreciated but not necessarily demanded, thus the concept of one individual tree supplying all of the above products is illusor.",
        "Common_diseases_and_Pests": "Cercosporidium gliricidiasis, Sirosporium gliricidiae, Colletotrichum truncatum"
      },
      {
        "Id": 26,
        "Scientific_Name": "Moringa oleifera",
        "Common_Name": "Drumstick",
        "Family": "Moringaceae",
        "Leaf_Division": "Compound",
        "Description": "M. oleifera is a fast-growing, deciduous tree that can reach a height of 10–12 m (32–40 ft) and trunk diameter of 45 cm (1.5 ft). The bark has a whitish-grey colour and is surrounded by thick cork. Young shoots have purplish or greenish-white, hairy bark. The tree has an open crown of drooping, fragile branches and the leaves build up a feathery foliage of tripinnate leaves.",
        "Utility": "Moringa plant is commonly grown for it&apos;s leaves, fruits, and oil. Moringa leaves and fruits are generally used in cooking. The oil can be used as a food supplement, as a base for cosmetics, and for hair and the skin.",
        "Common_diseases_and_Pests": "The moringa tree is not affected by any serious diseases in its native or introduced ranges. In India, several insect pests are seen, including various caterpillars such as the bark-eating caterpillar, the hairy caterpillar or the green leaf caterpillar. The budworms Noctuidae are known to cause serious defoliation. Damaging agents can also be aphids, stem borers, and fruit flies. In some regions, termites can also cause minor damage. If termites are numerous in soils, insects management costs are not bearable."
      },
      {
        "Id": 27,
        "Scientific_Name": "Santalum album",
        "Common_Name": "Sandalwood , Chandanamu (Telugu) , Chandan (Hindi) , Anukkam (Tamil) , Agarugandha (Kannada) , Valgaka (Oriya)",
        "Family": "santalaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "The height of the evergreen tree is between 4 and 9 metres. They may live to one hundred years of age. The tree is variable in habit, usually upright to sprawling, and may intertwine with other species.  An individual will form a non-obligate relationship with a number of other plants. Up to 300 species (including its own) can host the tree&apos;s development - supplying macro-nutrients phosphorus, nitrogen and potassium, and shade - especially during early phases of development. It may propagate itself through wood suckering during its early development, establishing small stands. The reddish or brown bark can be almost black and is smooth in young trees, becoming cracked with a red reveal.",
        "Utility": "S. album has been the primary source of sandalwood and the derived oil. These often hold an important place within the societies of its naturalised distribution range. The central part of the tree, the heartwood, is the only part of the tree that is used for its fragrance. It is yellow-brown in color, hard with an oily texture and due to its durability, is the perfect material for carving. The outer part of the tree, the sapwood, is unscented. The sapwood is white or yellow in color and is used to make turnery items. The high value of sandalwood has led to attempts at cultivation, this has increased the distribution range of the plant.The long maturation period and difficulty in cultivation have been restrictive to extensive planting within the range. Harvest of the tree involves several curing and processing stages, also adding to the commercial value."
      },
      {
        "Id": 28,
        "Scientific_Name": "Anacardium occidentale L.",
        "Common_Name": "Cashew, kaaju, jeedi pappu",
        "Family": "Anacardiaceae",
        "Leaf_Shape": "Obovate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "Anacardium occidentale, the cashew, is an evergreen tree in the Anacardiaceae (cashew or sumac family) that originated in Central and South America and is now cultivated commercially in semi-arid tropical areas in Africa, India, Sri Lanka, and southeastern Asia for the production of cashew nuts. The tree, which is up to 12 meters tall, has leathery alternate leaves, and flowers with 5 petals and 5 sepals. The fruits take an unusual form, with a kidney-shaped nut (drupe) borne on the end of an receptacle (the stem that holds the flower and fruit), which becomes enlarged and fleshy so that it appears as a fruit (with the nut like a comma dangling at its end), and is referred to as a “cashew apple.”",
        "Utility": "The cashew apple is edible, with an astringent flavor, and is used in jams, jellies, chutneys, and beverages (including a cashew wine); it is a good source of vitamin A and contains up to five times as much vitamin C as citrus juice. Cashew apples are also used as animal fodder. Cashew nuts, which are important in the cuisine of India, are often roasted and salted and eaten as a snack, and are high in protein, vitamins (A, D, K, and E) and minerals (including calcium, phosphorus, and iron). Other products from the plant include cashew nutshell liquid (CNSL), which is an irritant to human skin (it causes blisters similar to those of poison ivy, Toxcicodendron radicans, which is in the same genus) but is used as a lubricant and insecticide; and acajou gum, from the plant’s stem, which can be used as a substitute for gum arabic or in similar applications, such as varnish.",
        "Common_diseases_and_Pests": "Damping-off,Seedling blight"
      },
      {
        "Id": 29,
        "Scientific_Name": "Plumbago zeylanica",
        "Common_Name": "Plumbago",
        "Family": "Plumbaginaceae",
        "Leaf_Shape": "Spatulate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "\"The species include herbaceous plants and shrubs growing to 0.5–2 m tall. The leaves are spirally arranged, simple, entire, 0.5–12 cm long, with a tapered base and often with a hairy margin. The flowers are white with a tubular corolla with five petal-like lobes; they are produced in racemes.\n\nThe flower calyx has glandular trichomes (hairs), which secrete a sticky mucilage that is capable of trapping and killing insects; it is unclear what the purpose of these trichomes is; protection from pollination by way of \"\"crawlers\"\" (ants and other insects that typically do not transfer pollen between individual plants), or possible protocarnivory.\n\nMature plumbago leaves often have a whitish residue on their undersides, a feature that can confuse gardeners. While this white material resembles a powdery mildew disease or a chemical spray deposit, it is actually a natural exudate from \"\"chalk\"\" glands that are found on the Plumbago species.\"",
        "Utility": "Plant extracts have shown potent mosquito larvicidal activity against the larvae of Aedes aegypti while showing no toxicity to fish. Hexane extracts of Plumbago zeylanica have shown activity against canine distemper virus and also Antimicrobial activity. Methanol extract of plumbago zeylanica shows effect on root- knot nematode Meloidogyne spp.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 30,
        "Scientific_Name": "Buxus",
        "Common_Name": "Common box, European box,  Boxwood",
        "Family": "Buxaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "Buxus sempervirens is an evergreen shrub or small tree growing up to 1 to 9 m (3 to 30 ft) tall, with a trunk up to 20 centimetres (8 in) in diameter (exceptionally to 10 m tall and 45 cm diameter). Arranged in opposite pairs along the stems, the leaves are green to yellow-green, oval, 1.5–3 cm long, and 0.5–1.3 cm broad. The hermaphrodite flowers are inconspicuous but highly scented, greenish-yellow, with no petals, and are insect pollinated; the fruit is a three-lobed capsule containing 3-6 seeds",
        "Utility": "Slow growth of box renders the wood (\"boxwood\") very hard (possibly the hardest in Europe) and heavy, and free of grain produced by growth rings, making it ideal for cabinet-making, the crafting of flutes and oboes, engraving, marquetry, woodturning, tool handles, mallet heads and as a substitute for ivory. \nBuxus sempervirens is a medicinal plant used to treat many diseases.\nDue to it's evergreen nature, it is also used as an ornamental plant.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 31,
        "Scientific_Name": "Ixora coccinea(Orange Cultivar)",
        "Common_Name": "Ixora orange",
        "Family": "Rubiaceae",
        "Leaf_Shape": "Oblong",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "I. coccinea is a dense, multi-branched evergreen shrub, commonly 1.2–1.8 m in height, but capable of reaching up to 3.7 m high. It has a rounded form, with a spread that may exceed its height. The glossy, leathery, oblong leaves are about 10 cm long, with entire margins, and are carried in opposite pairs or whorled on the stems. Small tubular, scarlet flowers in dense rounded clusters 5.1–12.7 cm across are produced almost all year long.",
        "Utility": "\"It is primarily ornamental plant. Cut specimens are long lasting and are often used in floral arrangements. It is sometimes used as a hedge. In tropical Asia the flowers, bark and leaves of this plant are used in traditional medicine.\n\nIt is used for accent plants in planters and as an indoor potted plant. This species may also be shaped into bonsais.\"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 32,
        "Scientific_Name": "Ixora coccinea(Bright pink Cultivar)",
        "Common_Name": "Ixora bright pink",
        "Family": "Rubiaceae",
        "Leaf_Shape": "Oblong",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "I. coccinea is a dense, multi-branched evergreen shrub, commonly 1.2–1.8 m in height, but capable of reaching up to 3.7 m high. It has a rounded form, with a spread that may exceed its height. The glossy, leathery, oblong leaves are about 10 cm long, with entire margins, and are carried in opposite pairs or whorled on the stems. Small tubular, scarlet flowers in dense rounded clusters 5.1–12.7 cm across are produced almost all year long.",
        "Utility": "\"It is primarily ornamental plant. Cut specimens are long lasting and are often used in floral arrangements. It is sometimes used as a hedge. In tropical Asia the flowers, bark and leaves of this plant are used in traditional medicine.\n\nIt is used for accent plants in planters and as an indoor potted plant. This species may also be shaped into bonsais.\"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 33,
        "Scientific_Name": "Ixora coccinea(Dark pink Cultivar)",
        "Common_Name": "Ixora dark pink",
        "Family": "Rubiaceae",
        "Leaf_Shape": "Oblong",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "I. coccinea is a dense, multi-branched evergreen shrub, commonly 1.2–1.8 m in height, but capable of reaching up to 3.7 m high. It has a rounded form, with a spread that may exceed its height. The glossy, leathery, oblong leaves are about 10 cm long, with entire margins, and are carried in opposite pairs or whorled on the stems. Small tubular, scarlet flowers in dense rounded clusters 5.1–12.7 cm across are produced almost all year long.",
        "Utility": "\"It is primarily ornamental plant. Cut specimens are long lasting and are often used in floral arrangements. It is sometimes used as a hedge. In tropical Asia the flowers, bark and leaves of this plant are used in traditional medicine.\n\nIt is used for accent plants in planters and as an indoor potted plant. This species may also be shaped into bonsais.\"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 34,
        "Scientific_Name": "Ixora coccinea(Scarlet Cultivar)",
        "Common_Name": "Ixora scarlet",
        "Family": "Rubiaceae",
        "Leaf_Shape": "Oblong",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "I. coccinea is a dense, multi-branched evergreen shrub, commonly 1.2–1.8 m in height, but capable of reaching up to 3.7 m high. It has a rounded form, with a spread that may exceed its height. The glossy, leathery, oblong leaves are about 10 cm long, with entire margins, and are carried in opposite pairs or whorled on the stems. Small tubular, scarlet flowers in dense rounded clusters 5.1–12.7 cm across are produced almost all year long.",
        "Utility": "\"It is primarily ornamental plant. Cut specimens are long lasting and are often used in floral arrangements. It is sometimes used as a hedge. In tropical Asia the flowers, bark and leaves of this plant are used in traditional medicine.\n\nIt is used for accent plants in planters and as an indoor potted plant. This species may also be shaped into bonsais.\"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 35,
        "Scientific_Name": "Synogonium podophyllum",
        "Common_Name": "Arrow head",
        "Family": "Araceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "\"Syngonium podophyllum, commonly called arrowhead vine, is native from Mexico to Ecuador. It is an evergreen climbing vine that typically grows to 3-6’ long. As a houseplant, it is typically grown for its attractive ornamental foliage which changes shape as the leaves mature. Juvenile leaves (to 5.5” long) are ovate with heart-shaped bases and sometimes with silver variegation. Leaves mature to arrow shape. Later leaves become pedate (to 14” long), each with 5-11 leaflets. Tiny green to greenish-white flowers on a spadix are surrounded by a greenish-white spathe (to 4.5” long). Flowers are born in groups in the leaf axils. Flowers give way to brown-black berries. Plants rarely flower in cultivation. Synonymous with Nephthytis triphylla.\n\nGenus name comes form the Greek words syn meaning together and gone meaning reproductive organs for the united ovaries.\n\nSpecific epithet means with stout-stalked leaves.\"",
        "Utility": "\"A decoction of the crushed and boiled leaf is used as a wash to treat stomachache. The milky-white sap from a broken stem is applied topically as a remedy for the bite of Paraponera ants. The sap is swabbed into the cavity of an aching tooth in order to relieve the pain. The roots and bark are antibacterial and antiinflammatory. They are used in the treatment of superficial and deep wound, and various skin disorders. Extracts of the leaves and bark have been shown to have a dose-dependent effect upon treating oedema, showing they they are potential sources of principles with high anti-inflammatory activity.\n\nThis is one of the species studied in a trial and found effective in helping to remove indoor air pollutants.\"",
        "Common_diseases_and_Pests": "Soft rot, bacterial leaf spot"
      },
      {
        "Id": 36,
        "Scientific_Name": "Tecoma capensis",
        "Common_Name": "Cape Honey Suckle",
        "Family": "Bignoniaceae",
        "Leaf_Shape": "Oblong",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Compound",
        "Description": "Cape honeysuckle is a fast growing, scrambling shrub which may grow up to 2-3m high and spread more than 2.5m. Tecomaria capensis is an evergreen plant in warm climate areas but loses its leaves in colder areas. It has pinnately compound leaves that have oval leaflets with blunt teeth. Flowering time for this shrub is very erratic and often it flowers all year round. Flowers vary from red, deep orange, yellow to salmon. Flowers are tubular and bird pollinated, attracting nectar-feeding birds, especially sunbirds.",
        "Utility": "Tecomaria capensis is an ornamental garden plant commonly used for screening and decorative purposes. It can also be trimmed to form a hedge. It is often planted specifically to attract birds and butterflies. The powdered bark of this attractive garden plant is used as a traditional medicine to relieve pain and sleeplessness.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 37,
        "Scientific_Name": "Tabernaemontana divaricata(pinwheel)",
        "Common_Name": "Pinwheel Jasmine, Chandni",
        "Family": "Apocynaceae",
        "Leaf_Shape": "Elliptical",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "The plant generally grows to a height of 1.5–1.8 m and is dichotomously-branched. The large shiny leaves are deep green and about 15 cm in length and 5.1 cm in width. The waxy blossoms are found in small clusters on the stem tips. The (single) flowers have the characteristic 'pinwheel' shape also seen in other genera in the family Apocynaceae such as Vinca and Nerium. Both single and double-flowered forms are cultivated, the flowers of both forms being white. The plant blooms in spring but flowers appear sporadically all year. The flowers of the single form are unscented but the double-flowered form has a pleasing fragrance. The roots have a bitter taste.",
        "Utility": "They are used in Ayurvedic medicine and the traditional medicine of South East Asia, the Malay Peninsula, Indonesia, and Ambon Island.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 38,
        "Scientific_Name": "Aucuba japonica",
        "Common_Name": "Spotted laurel, Japanese laurel, Japanese aucuba, Gold dust plant",
        "Family": "Garryaceae",
        "Leaf_Shape": "Lanceolate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "Aucuba japonica, commonly called spotted laurel, Japanese laurel, Japanese aucuba or gold dust plant (U.S.), is a shrub (1–5 m) native to rich forest soils of moist valleys, thickets, by streams and near shaded moist rocks in China, Korea, and Japan. This is the species of Aucuba commonly seen in gardens - often in variegated form. The leaves are opposite, broad lanceolate, 5–8 cm long and 2–5 cm wide. Aucuba japonica are dioecious. The flowers are small, 4–8 mm diameter, each with four purplish-brown petals; they are produced in clusters of 10-30 in a loose cyme. The fruit is a red drupe approximately 1 cm in diameter, which is avoided by birds.",
        "Utility": "This plant is valued for its ability to thrive in the most difficult of garden environments, dry shade. It also copes with pollution and salt-laden coastal winds. It is often seen as an informal hedge, but may also be grown indoors as a houseplant. Today numerous cultivars are available from garden centres. The most popular cultivar is 'Variegata', with yellow spots on the leaves; this is a female clone, a similar male clone being named 'Maculata'.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 39,
        "Scientific_Name": "Cupressus sempervirens",
        "Common_Name": "Peacock tail,  Italian cypress, Tuscan cypress, Persian cypress, Pencil pine",
        "Family": "Cupressaceae",
        "Leaf_Shape": "Oblong",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "\"Cupressus sempervirens is a medium-sized coniferous evergreen tree to 35 m  tall, with a conic crown with level branches and variably loosely hanging branchlets.It is very long-lived, with some trees reported to be over 1,000 years old.\n\nThe foliage grows in dense sprays, dark green in colour. The leaves are scale-like, 2–5 mm long, and produced on rounded (not flattened) shoots. The seed cones are ovoid or oblong, 25–40 mm long, with 10-14 scales, green at first, maturing brown about 20–24 months after pollination. The male cones are 3–5 mm long, and release pollen in late winter.\"",
        "Utility": "Mediterranean cypress has been widely cultivated as an ornamental tree for millennia away from its native range, mainly throughout the whole Mediterranean region, and in other areas with similar hot, dry summers and mild, rainy winters, including California, southwest South Africa and southern Australia. It can also be grown successfully in areas with cooler, moister summers, such as the British Isles, New Zealand and the Pacific Northwest (coastal Oregon, Washington and British Columbia). It is also planted in Florida and parts of the coastal southern United States as an ornamental tree. In some areas, particularly the United States, it is known as \"Italian\" or \"Tuscan cypress\".",
        "Common_diseases_and_Pests": "cypress canker, extensive dieback"
      },
      {
        "Id": 40,
        "Scientific_Name": "Azadirachta indica",
        "Common_Name": "Neem, Vepa, Indian lilac",
        "Family": "Meliaceae",
        "Leaf_Shape": "Lanceolate",
        "Leaf_margin_edge": "Serrate",
        "Leaf_Division": "Compound",
        "Description": "\"Azadirachta indica is a tree in the mahogany family Meliaceae. It is one of two species in the genus Azadirachta, and is native to India, Burma, Bangladesh, Sri Lanka, Malaysia and Pakistan, growing in tropical and semi-tropical regions.\n\nNeem is a fast-growing tree that can reach a height of 15–20 m, rarely to 35–40 m. It is evergreen, but in severe drought it may shed most or nearly all of its leaves. The branches are wide spread.\n\nIt blossoms in spring with the small white flowers. It has a straight trunk. Its bark is hard rough and scaly, fissured even in small trees. The color of the bark is brown grayish. The leaves are alternate and consist of several leaflets with serrated edges. Its flowers are small and white in color. The olive like edible fruit is oval, round and thin skinned.\n\nThe Neem tree is noted for its drought resistance. Normally it thrives in areas with sub-arid to sub-humid conditions. Neem is a life-giving tree. It is one of the very few shade-giving trees that thrive in the drought-prone areas. The trees are not at all delicate about the water quality and thrive on the merest trickle of water, whatever the quality.\"",
        "Utility": "\"Azadirachta indica is variously known as Sacred Tree, Heal all, Village Pharmacy and Panacea for all diseases. Products made from Neem tree have been used in India for over two millennia for their medicinal properties.\n\nNeem products are cheap and non-toxic to higher animals and most beneficial insects, they are well-suited for pest control in rural areas.\n\nNeem tree is of great importance for its anti-desertification properties and possibly as a good carbon dioxide sinks. Neem is considered as the useful tree in rehabilitating the waste land areas.\n\nNeem seed pulp is useful for methane gas production. It is also useful as carbohydrate which is rich base for other industrial fermentations. Neem bark contains tannins which are used in tanning and dyeing.\"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 41,
        "Scientific_Name": "Mangifera indica",
        "Common_Name": "Mango, Mamida, Aam",
        "Family": "Anacardiaceae",
        "Leaf_Shape": "Elliptical",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "The mango tree is a large, spreading evergreen with a dense crown. Mature trees can attain a height of 40 m or more, with a 60-120 cm trunk and greyish-brown, longitude-fissured bark. Leaves are produced in flushes of 10-12 new leaves, 1-3 times a year. Leaves persist on the tree for 4-5 years before being shed. Leaf morphology is highly variable depending on cultivar. Leaves are spirally arranged, simple; young leaves are copper-coloured, turning to light then dark shiny green; petiole 1-12.5 cm long, with pulvinus at the base; blade variable in size and shape, usually narrowly elliptic to lanceolate, 12-38 x 2-13 cm, somewhat leathery, tapering at base, margin often undulate, apex acuminate, nerves 12-30 pairs, elevated on both surfaces.",
        "Utility": "Mango fruit is edible for human consumption.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 42,
        "Scientific_Name": "Acalypha wilkesiana",
        "Common_Name": "Acalypa,  Copperleaf, Jacob’s coat",
        "Family": "Euphorbiaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Serrate",
        "Leaf_Division": "Simple",
        "Description": "Acalypha wilkesiana, common names copperleaf and Jacob’s coat, is an evergreen shrub growing to 3 metres  high and 2 metres  across. It has a closely arranged crown, with an erect stem and many branches. Both the branches and the leaves are covered in fine hairs The leaves, which may be flat or crinkled, are large and broad with teeth around the edge. They can be 10–20 centimetres long and 15 centimetres wide. The leaves are coppery green with red splashes, giving them a mottled appearance. Separate male and female flowers appear on the same plant. The male flowers are in long spikes which hang downwards while the female flowers are in short spikes. The latter do not show up easily as they are often hidden among the leaves. The flower stalks are 10–20 cm long.",
        "Utility": "The plant is sometimes harvested from the wild for local use as a food and as a medicine. It is widely cultivated as an ornamental plant, being especially valued for its wide range of variegated cultivars, and is also often grown as a hedge.",
        "Common_diseases_and_Pests": "Indoors, scale insects, spider mites, whiteflies, and mealybugs may be problems. In the garden, downy mildew, powdery mildew, rust leaf spots, and fungal root rots can occur"
      },
      {
        "Id": 43,
        "Scientific_Name": "Dracaena reflexa",
        "Common_Name": "Song of India",
        "Family": "Asparagaceae",
        "Leaf_Shape": "Lanceolate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "\"While it may reach a height of 4–5 m, rarely 6 m in ideal, protected locations, D. reflexa is usually much smaller, especially when grown as a houseplant. It is slow-growing and upright in habit, tending to an oval shape with an open crown. The lanceolate leaves are simple, spirally arranged, 5–20 cm long and 1.5–5 cm broad at the base, with a parallel venation and entire margin; they grow in tight whorls and are a uniform dark green.\n\nThe flowers are small, clustered, usually white and extremely fragrant, appearing in mid winter. Neither the flowers nor the fruit are especially showy. D. reflexa var. angustifolia (syn. D. marginata) differs in having a magenta tint to its flowers, a shrubby habit, and olive green leaves.\"",
        "Utility": "t is one of the plants used in the NASA Clean Air Study and has shown to help remove formaldehyde. It is an effective air cleaner and is said to be among the best plants for removing xylene and trichloroethylene.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 44,
        "Scientific_Name": "Phyllanthus emblica",
        "Common_Name": "Amla, Emblic, Emblic myrobalan, Myrobalan, Indian gooseberry",
        "Family": "Phyllanthaceae",
        "Leaf_Shape": "Oblong",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "The tree is small to medium in size, reaching 1–8 m  in height. The branchlets are not glabrous or finely pubescent, 10–20 cm long, usually deciduous; the leaves are simple, subsessile and closely set along branchlets, light green, resembling pinnate leaves. The flowers are greenish-yellow. The fruit is nearly spherical, light greenish yellow, quite smooth and hard on appearance, with six vertical stripes or furrows. Ripening in autumn, the berries are harvested by hand after climbing to upper branches bearing the fruits.",
        "Utility": "\"In traditional Indian medicine, dried and fresh fruits of the plant are used. Pratapgarh is one of the largest producers and suppliers of Indian gooseberries. In this region, the fruit is commonly pickled with salt, oil, and spices.\nPopularly used in inks, shampoos and hair oils, the high tannin content of Indian gooseberry fruit serves as a mordant for fixing dyes in fabrics. Amla shampoos and hair oil are traditionally believed to nourish the hair and scalp and prevent premature grey hair.\"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 45,
        "Scientific_Name": "Rubus argutus",
        "Common_Name": "Black Berry",
        "Family": "Rosaceae",
        "Leaf_Shape": "Elliptical",
        "Leaf_margin_edge": "Dentate",
        "Leaf_Division": "Simple",
        "Description": "\"This shrub develops first-year and second-year canes that are 2-6' high; the canes often bend or arch to one side, sometimes touching the ground at their tips. The slightly woody canes are light green to dark red, stout, angular, furrowed or ridged, and glabrous; they have sharp prickles less than ¼\"\" long that are straight to slightly curved. The alternate leaves are palmately compound. First-year canes have palmate leaves with 5 leaflets; these leaflets are 3-5\"\" long, 1-2¼\"\" across, elliptic to ovate, and sharply toothed. Second-year canes have palmate leaves with 3 leaflets; these leaflets are similar to the leaflets of first-year canes, except they are a little smaller in size. The upper surface of the leaflets is medium green or yellowish green, indented along the veins, and either hairless or sparsely covered with appressed hairs. The lower surface of the leaflets is pale green with prominent veins; the vein undersides are either hairless or covered with appressed hairs, while the lower surface between the veins is hairless to sparsely hairy. The basal stalklets (petiolules) of the leaflets are light green or yellowish green and either hairless or covered with appressed hairs; they vary in length from 1/8\"\" or 3 mm. (for lower lateral leaflets) to 1/2\"\" or 6 mm. (for terminal leaflets). The petioles of the leaves are 2-4\"\" long; they are light green to yellowish green and either hairless or covered with appressed hairs. The petioles have small prickles along their undersides. At the base of each petiole, there is a pair of deciduous linear stipules (less than ½\"\" long). \n\nSecond-year canes develop elongated racemes of 5-20 flowers about 2-6\"\" long. The peduncle and pedicels of each raceme are light green to yellowish green and more or less covered with appressed woolly hairs that are white to pale brown; these hairs are non-glandular. The pedicels are ascending to widely spreading. The leafy bracts of each raceme are small, inconspicuous, and deciduous. Individual flowers are about ¾-1\"\" across, consisting of 5 white petals, 5 light green sepals, a greenish compound pistil with multiple styles, and a ring of many stamens. The widely spreading petals are oblong to elliptic in shape, while the sepals are lanceolate, recurved, and densely covered with appressed white hairs. The blooming period occurs during the late spring and lasts about 3 weeks. During the summer, the flowers are replaced by fruits that are compound drupes. At maturity, these compound drupes change from bright red to black; they are about 1/3-2/3\"\" (8-16 mm.) in length and globoid to ovoid in shape. Each drupelet of a drupe contains a single yellow seed. Mature drupes are juicy and vary in flavor from sour to sweet-tart. Second-year canes die down after bearing fruits, but they are replaced by new canes from underground runners.\"",
        "Utility": "Fruits are edible for human consumption.  The roots are antihaemorrhoidal, antirheumatic, astringent, stimulant and tonic. An infusion can be used in the treatment of venereal disease and as a wash in the treatment of piles.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 46,
        "Scientific_Name": "Chlorophytum comosum",
        "Common_Name": "Spider plant",
        "Family": "Asparagaceae",
        "Leaf_Shape": "Linear",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "\"Chlorophytum comosum grows to about 60 centimetres  high. It has fleshy, tuberous roots, about 5–10 cm  long. The long narrow leaves reach a length of 20–45 cm and are around 6–25 millimetres wide.\nFlowers are produced in a long branched inflorescence, which can reach a length of up to 75 cm and eventually bends downwards. Flowers initially occur in clusters of 1–6 at intervals along the stem (scape) of the inflorescence. Each cluster is at the base of a bract, which ranges from 2–8 cm in length, becoming smaller towards the end of the inflorescence. Most of the flowers which are produced initially die off, so that the inflorescences are relatively sparsely flowered.\"",
        "Utility": "Chlorophytum comosum is a popular houseplant. This cultivar has gained the Royal Horticultural Society's Award of Garden Merit.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 47,
        "Scientific_Name": "Aucuba japonica(thin)",
        "Common_Name": "Gold dust(thin),spotted laurel, Japanese laurel, Japanese aucuba",
        "Family": "Garryaceae",
        "Leaf_Shape": "Linear",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "Aucuba japonica, commonly called spotted laurel, Japanese laurel, Japanese aucuba or gold dust plant (U.S.), is a shrub (1–5 m) native to rich forest soils of moist valleys, thickets, by streams and near shaded moist rocks in China, Korea, and Japan. This is the species of Aucuba commonly seen in gardens - often in variegated form. The leaves are opposite, broad lanceolate, 5–8 cm long and 2–5 cm wide. Aucuba japonica are dioecious. The flowers are small, 4–8 mm diameter, each with four purplish-brown petals; they are produced in clusters of 10-30 in a loose cyme. The fruit is a red drupe approximately 1 cm in diameter, which is avoided by birds.",
        "Utility": "This plant is valued for its ability to thrive in the most difficult of garden environments, dry shade. It also copes with pollution and salt-laden coastal winds. It is often seen as an informal hedge, but may also be grown indoors as a houseplant. Today numerous cultivars are available from garden centres. The most popular cultivar is 'Variegata', with yellow spots on the leaves; this is a female clone, a similar male clone being named 'Maculata'.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 48,
        "Scientific_Name": "Senna auriculata",
        "Common_Name": "Tangedu, Ranawara, Avaram",
        "Family": "Fabaceae",
        "Leaf_Shape": "Obovate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Compound",
        "Description": "\"Avaram senna is a much branched shrub with smooth cinnamon brown bark and closely pubescent brachlets.\n\nThe leaves are alternate, stipulate, paripinnate compound, very numerous, closely placed, rachis 8.8-12.5 cm long, narrowly furrowed, slender, pubescent, with an erect linear gland between the leaflets of each pair, leaflets 16-24, very shortly stalked 2-2.5 cm long 1-1.3 cm broad, slightly overlapping, oval oblong, obtuse, at both ends, mucronate, glabrous or minutely downy, dull green, paler beneath, stipules very large, reniform-rotund, produced at base on side of next petiole into a filliform point and persistent.\n\nIts flowers are irregular, bisexual, bright yellow and large (nearly 5 cm across), the pedicels glabrous and 2.5 cm long. The racemes are few-flowered, short, erect, crowded in axils of upper leaves so as to form a large terminal inflorescence stamens barren; the ovary is superior, unilocular, with marginal ovules.\n\nThe fruit is a short legume, 7.5–11 cm long, 1.5 cm broad, oblong, obtuse, tipped with long style base, flat, thin, papery, undulately crimpled, pilose, pale brown. 12-20 seeds per fruit are carried each in its separate cavity.\"",
        "Utility": "Senna auriculata is suitable for landscaping roadways and home gardens. It tolerates drought and dry conditions, but not much cold. The flowers in racemes are also attractive. The plant has been shown to have antibacterial activity in the laboratory.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 49,
        "Scientific_Name": "Hymenocallis littoralis",
        "Common_Name": "Spider lily",
        "Family": "Amaryllidaceae",
        "Leaf_Shape": "Linear",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "Hymenocallis littoralis is a bulbous perennial herb. It ranges in height from 60–70 cm (36 inches). The bulb is 7–10 cm (3-4 inches) in diameter. With age, the bulb develops a neck that reaches 4–5 cm in diameter (up to 2 inches). The flowers are large, white, vanilla scented, and sessile. The tepals are adnate (attached to) the staminal cup. Each flower's tube is 14 to 17 cm (5 to 7 inches) long or longer",
        "Utility": "\"Hymenocallis littoralis is often grown as an ornamental. It requires sunlight to partial shade for proper growth and blooms from mid-summer to late autumn with white flowers. It may be grown aquatically.\n\nHymenocallis littoralis is included in the Tasmanian Fire Service's list of low flammability plants, indicating that it is suitable for growing within a building protection zone.\"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 50,
        "Scientific_Name": "Caladium bicolor",
        "Common_Name": "Caladium",
        "Family": "Araceae",
        "Leaf_Shape": "Peltate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "Caladiums are tuber-rooted tropical perennials grown for their large and showy leaves. Caladiums have no stems; the leaves are borne on long, 6-12 in (15-30.5 cm), petioles (leaf stems) that arise directly from the underground tuber. The petioles are attached to the leaves near the center, rather than at one end, a condition called peltate. Leaf shape, size and color vary among the hundreds of selections, but most are heart, lance or arrowhead shaped, 6-14 in (15-35.6 cm) long, and variously spotted or streaked with pink, red, gray, or white. The caladium inflorescence is a 9 in (23 cm) greenish white Jack-in-the-pulpit-like spadix and spathe. (The spadix is the fleshy upright spike with tiny flowers on it - Jack; and the spathe is the hood-like bract that surrounds the spadix - the pulpit.) Small white berries eventually develop on the spadix. The whole plant, by the end of its growing season, is about 2 ft (0.6 m) tall and 2 ft (0.6 m) wide.",
        "Utility": "\"Caladiums are used in shady beds and borders. They often are planted along the north or east side of a building or wall. Caladiums are striking in dense plantings. They provide warm color in areas too shady for most flowers. Use caladiums to provide some color amongst lacy ferns and stately gingers.\n\nCaladiums also are grown in containers and in the greenhouse. Indoor caladiums should be misted daily or even more often and given bright light, but never direct sun. Caladium leaves will last for several days in fresh flower arrangements.\"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 51,
        "Scientific_Name": "Rhynchosia courtallensis",
        "Common_Name": "Snoutbean",
        "Family": "Fabaceae",
        "Leaf_Shape": "Cordate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "Courtallam Snoutbean is a climbing shrub,rusty woolly. Leaves are trifoliate with the end leaflet up to 10 x 8 cm, lateral 8 x 6 cm, oblique at base, rhomboid-ovate, tip tapering, base oblique, slightly heart-shaped; leaf-stalk to 5 cm, leaflet-stalk 0.3-2 cm, stipules and stipels linear, velvet-hairy. Flowers are borne in panicles in leaf-axils. Flowers are yellow; flower-cluster-stalks up to 2 cm, velvet-hairy; calyx tube 7 mm, velvet-hairy, sepals 4 mm, triangular; standard petal 3 x 2 cm, round, eard; wings 2.5 x 1 cm, obliquely obovate; keels 2.5 x 1 cm, club-shaped; staminal sheath 2 cm, filaments 9 mm; anthers 1 mm; ovary 8 mm, ovules many, woolly, style 2 cm, hairy, stigma oblique. Pods are 4 x 1 cm, velvet-hairy, beaked. Courtallam Snoutbean is found in Peninsular India and Sri Lanka. Flowering: January-April.",
        "Utility": "Unknown",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 52,
        "Scientific_Name": "Caesalpinia pulcherrima",
        "Common_Name": "Peacock Flower",
        "Family": "Fabaceae",
        "Leaf_Shape": "Elliptical",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Compound",
        "Description": "It is a shrub growing to 3 m tall. In climates with few to no frosts, this plant will grow larger and is semievergreen. Grown in climates with light to moderate freezing, plant will die back to the ground depending on cold, but will rebound in mid- to late spring. This species is more sensitive to cold than others. The leaves are bipinnate, 20–40 cm long, bearing three to 10 pairs of pinnae, each with six to 10 pairs of leaflets 15–25 mm long and 10–15 mm broad. The flowers are borne in racemes up to 20 cm long, each flower with five yellow, orange, or red petals. The fruit is a pod 6–12 cm long.",
        "Utility": "\"C. pulcherrima is the most widely cultivated species in the genus Caesalpinia. It is a striking ornamental plant, widely grown in domestic and public gardens in warm climates with mild winters, and has a beautiful inflorescence in yellow, red, and orange. Its small size and the fact that it tolerates pruning well allows it to be planted in groups to form a hedgerow; it can be also used to attract hummingbirds. \nAll seeds of Caesalpinia are poisonous. However, the seeds of some species are edible before they reach maturity (e.g. immature seeds of C. pulcherrima) or after treatment (e.g. C. bonduc after roasting). Maroon medicine men in Suriname have long known some of the medicinal uses for C. pulcherrima, which is known as ayoowiri. Four grams from the root are also said to induce abortion in the first trimester of pregnancy\"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 53,
        "Scientific_Name": "Mussaenda cv 'Marmalade'",
        "Common_Name": "Mussaenda, Paper chase tree",
        "Family": "Rubiaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "Marmalade Mussaenda is a new and distinct cultivar of Mussaenda, formed by hybridization of female parent Mussaenda philippica ‘Dona Luz’ and male parent Mussaenda luteola. It is a tropical upright shrub, with many branches, soft wood, terminating in velvet-like soft leaves. It is compact, multi-branched, non-suckering from base, hard wood trunk, new growth soft and flexuous, hardening off after some time. It grows up to about 2.44 m when 2-years old, with a spread of about 2 m. Mature leaves are 17-19.7 cm long, 7.6-8.9 cm wide. Flowers are umbrella-shaped, about 2 cm across, consisting of 5 petals with the bases fused to form a long tube. Each petal has a prominent ridge on the upper surface extending from near the center of the flower to the tip of each petal running the length of the petal. Petals are velvet-hairy, very short upright hairs cover both surfaces and make the surface appear to sparkle; dense longer hairs located at the center of the flower form a central \"eye\". Mature sepals are 4.0-4.5 cm long, 2.8-3.0 cm wide, much larger than the petals. Upper surface is pubescent with very short upright hairs which make the surface appear to sparkle. Shades of red and yellow inspired the cultivar name Marmalade.",
        "Utility": "Ornamental plant",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 54,
        "Scientific_Name": "Sphagneticola trilobata",
        "Common_Name": "Singapore Diasy",
        "Family": "Asteraceae",
        "Leaf_Shape": "Lanceolate",
        "Leaf_margin_edge": "Serrate",
        "Leaf_Division": "Simple",
        "Description": "Spreading, mat-forming perennial herb up to 30 cm in height. Has rounded stems up to 40 cm long, rooting at nodes and with the flowering stems ascending. Leaves are fleshy, hairy, 4–9 cm long and 2–5 cm wide, serrate or irregularly toothed, normally with pairs of lateral lobes, and dark green above and lighter green below. Peduncles are 3–10 cm long; involucres are campanulate to hemispherical, about 1 cm high; chaffy bracts are lanceolate, rigid. The flowers are bright yellow ray florets of about 8-13 per head, rays are 6–15 mm long; disk-corollas 4–5 mm long. The pappus is a crown of short fimbriate scales. The seeds are tuberculate achenes, 4–5 mm long. Propagation is mostly vegetatively as seeds are usually not fertile.",
        "Utility": "\"It is spread by people as an ornamental or groundcover that is planted in gardens, and then it is spread into surrounding areas by dumping of garden waste. It spreads vegetatively, not by seed. It rapidly forms a dense ground cover, crowding away and preventing other plant species from regenerating. This species is widely available as an ornamental and is therefore likely to spread further.\n\nIt is a noxious weed in agricultural land, along roadsides urban waste places and other disturbed sites. It is also invasive along streams, canals, along the borders of mangrove swamps and in coastal vegetation.\"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 55,
        "Scientific_Name": "Schefflera taiwaniana",
        "Common_Name": "Schefflera, Umbrella tree",
        "Family": "Araliaceae",
        "Leaf_Shape": "Cuneate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "S. taiwaniana can make a single-stemmed, small tree, or a multi-stemmed shrub. The glossy, dark, evergreen leaves have up to 11 narrow, pointed leaflets arranged like the spokes of a wheel, on long, dark red stalks. Young foliage is covered in silvery hairs. Green-brown flowers are produced in branched sprays in late summer, followed by purple-black berries in winter",
        "Utility": "This is used as a garden plant.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 56,
        "Scientific_Name": "Cycas revoluta",
        "Common_Name": "Sago palm, Kungi palm",
        "Family": "Cycadaceae",
        "Leaf_Shape": "Linear",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Compound",
        "Description": "\"This very symmetrical plant supports a crown of shiny, dark green leaves on a thick shaggy trunk that is typically about 20 cm (7.9 in) in diameter, sometimes wider. The trunk is very low to subterranean in young plants, but lengthens above ground with age. It can grow into very old specimens with 6–7 m (over 20 feet) of trunk; however, the plant is very slow-growing and requires about 50–100 years to achieve this height. Trunks can branch several times, thus producing multiple heads of leaves.\nThe leaves are a deep semiglossy green and about 50–150 cm (20–59 in) long when the plants are of a reproductive age. They grow out into a feather-like rosette to 1 m (3.3 ft) in diameter. The crowded, stiff, narrow leaflets are 8–18 cm (3.1–7.1 in) long and have strongly recurved or revolute edges. The basal leaflets become more like spines. The petiole or stems of the sago cycad are 6–10 cm (2.4–3.9 in) long and have small protective barbs.\n\nRoots are called coralloid with an Anabaena symbiosis allowing nitrogen fixation. Tannins-rich cells are found on either side of the algal layer to resist the algal invasion.\n\nAs with other cycads, it is dioecious, with the males bearing pollen cones (strobilus) and the females bearing groups of megasporophylls. Pollination can be done naturally by insects or artificially.\"",
        "Utility": "Of all the cycads, C. revoluta is the most popular in cultivation. It is seen in almost all botanical gardens, in both temperate and tropical locations. In many areas of the world, it is heavily promoted commercially as a landscape plant. It is also quite popular as a bonsai plant. First described in the late 18th century, it is tolerant of mild to somewhat cold temperatures, provided the ground is dry. Frost damage can occur at temperatures below −10 °C (14 °F), and several healthy plants have been grown with little protection as far north as St. Louis, Missouri and New York, New York, both in USDA zone 7b. C. revoluta usually defoliates in this temperate climate, but will usually flush (or grow) several new leaves by spring.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 57,
        "Scientific_Name": "Ricinus communis L.",
        "Common_Name": "Castor, aamudam",
        "Family": "Euphorbiaceae",
        "Leaf_Shape": "Palmate",
        "Leaf_margin_edge": "Dentate",
        "Leaf_Division": "Simple",
        "Description": "\"Ricinus communis can vary greatly in its growth habit and appearance. The variability has been increased by breeders who have selected a range of cultivars for leaf and flower colours, and for oil production. It is a fast-growing, suckering shrub that can reach the size of a small tree, around 12 m (39 ft), but it is not cold hardy.\n\nThe glossy leaves are 15–45 cm (5.9–17.7 in) long, long-stalked, alternate and palmate with five to twelve deep lobes with coarsely toothed segments. In some varieties they start off dark reddish purple or bronze when young, gradually changing to a dark green, sometimes with a reddish tinge, as they mature. The leaves of some other varieties are green practically from the start, whereas in yet others a pigment masks the green color of all the chlorophyll-bearing parts, leaves, stems and young fruit, so that they remain a dramatic purple-to-reddish-brown throughout the life of the plant. Plants with the dark leaves can be found growing next to those with green leaves, so there is most likely only a single gene controlling the production of the pigment in some varieties. The stems and the spherical, spiny seed capsules also vary in pigmentation. The fruit capsules of some varieties are more showy than the flowers.\"",
        "Utility": "\"Castor oil has many uses in medicine and other applications.\n\nAn alcoholic extract of the leaf was shown, in lab rats, to protect the liver from damage from certain poisons. Methanolic extracts of the leaves of Ricinus communis were used in antimicrobial testing against eight pathogenic bacteria in rats and showed antimicrobial properties. The pericarp of Ricinus showed central nervous system effects in mice at low doses. At high doses mice quickly died. A water extract of the root bark showed analgesic activity in rats.Antihistamine and anti-inflammatory properties were found in ethanolic extract of Ricinus communis root bark.\"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 58,
        "Scientific_Name": "Carica papaya",
        "Common_Name": "Papaya",
        "Family": "Caricaceae",
        "Leaf_Shape": "Palmate",
        "Leaf_margin_edge": "Dentate",
        "Leaf_Division": "Simple",
        "Description": "The papaya is a small, sparsely branched tree, usually with a single stem growing from 5 to 10 m (16 to 33 ft) tall, with spirally arranged leaves confined to the top of the trunk. The lower trunk is conspicuously scarred where leaves and fruit were borne. The leaves are large, 50–70 cm (20–28 in) in diameter, deeply palmately lobed, with seven lobes. All parts of the plant contain latex in articulated laticifers. Papayas are dioecious. The flowers are 5-parted and highly dimorphic, the male flowers with the stamens fused to the petals. The female flowers have a superior ovary and five contorted petals loosely connected at the base. Male and female flowers are borne in the leaf axils, the males in multiflowered dichasia, the female flowers is few-flowered dichasia. The flowers are sweet-scented, open at night and are moth-pollinated. The fruit is a large berry about 15–45 cm (5.9–17.7 in) long and 10–30 cm (3.9–11.8 in) in diameter. It is ripe when it feels soft (as soft as a ripe avocado or a bit softer) and its skin has attained an amber to orange hue.",
        "Utility": "Originally from southern Mexico (particularly Chiapas and Veracruz), Central America, and northern South America, the papaya is now cultivated in most tropical countries. In cultivation, it grows rapidly, fruiting within three years. It is, however, highly frost-sensitive, limiting its production to tropical climates. Temperatures below −2 °C (29 °F) are greatly harmful if not fatal.",
        "Common_diseases_and_Pests": "Papaya ringspot virus, papaya mosaic virus"
      },
      {
        "Id": 59,
        "Scientific_Name": "Dypsis lutescens",
        "Common_Name": "Butterfly palm",
        "Family": "Arecaceae",
        "Leaf_Shape": "Lanceolate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Compound",
        "Description": "Dypsis lutescens grows 6–12 m (20–39 ft) in height. Multiple stems emerge from the base. The leaves are arched, 2–3 m (6 ft 7 in–9 ft 10 in) long, and pinnate, with 40-60 pairs of leaflets. It bears panicles of yellow flowers in summer. Offsets can be cut off when mature enough, as a propagation method.",
        "Utility": "\"t is grown as an ornamental plant in gardens in tropical and subtropical regions, and elsewhere indoors as a houseplant. It has gained the Royal Horticultural Society's Award of Garden Merit. \nAccording to NASA and Dr. B. C. Wolverton, the areca palm filters xylene and toluene from the air. Wolverton also specifies that, at 1.8 m (5 ft 11 in) in height, the plant will transpire 1 liter of water per 24 hours, thereby making it an effective humidifier.\"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 60,
        "Scientific_Name": "Wodyetia bifurcata A.K.Irvine",
        "Common_Name": "Foxtail palm",
        "Family": "Arecaceae",
        "Leaf_Shape": "Lanceolate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "\"It has very attractive palm with long (2-3m.) plumose leaves (hence the name 'Foxtail'), and up to 10m tall with a grey trunk. It produces large (about the size of a duck egg) orange fruit.\n\nFlowering: White flowers stalk that comes from the base of the crownshaft.\n\nFoliage: Variance of greenish colors; deep green to light green colors. Received its more commonly known Australian-English name from the appearance of its foliage, which is in a shape of a fox’s tail.\n\nFruits: 2 inches long. Olive green to green in the early stages. Orange red when ripe.\n\nTrunk: Similar to the king palm, the foxtail palm trunk is smooth, thin, and self-cleaning. It grows a single, double, or triple trunk that is slightly spindle-shaped to columnar reaching heights of about 30 ft. The trunk also has a closely ringed, dark grey to light gray color which slowly turns more and more white. The crownshaft of the foxtail palm is light to bright green and slightly swollen at the base.\"",
        "Utility": "It is used as ornamental plant.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 61,
        "Scientific_Name": "Furcraea foetida ‘Medio-picta’",
        "Common_Name": "Mauritius Hemp, Giant Cabuya, Green Aloe, Furcraea gigantea 'Variegata', Giant False Agave, Variegated Malagache Aloe",
        "Family": "Agavaceae",
        "Leaf_Shape": "Lanceolate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "Grown for its terri c variegated foliage, Furcraea foetida 'Mediopicta' is an evergreen succulent perennial which forms a fountain of upright, long, sword-shaped leaves with slightly wavy margins, resembling undulating ribbons. Soft and not serrated, the luminous green leaves are adorned with a broad, decorative creamy-yellow stripe along their center. Usually stemless, this plant produces strongly scented, greenish to creamy-white owers atop a 25 ft. spike (6m) that is attractive to bees. They open in succession over several weeks. This plant is monocarpic and dies after owering. While it does not o set and form pups, it produces abundant plantlets along the bloom spike that you may want to replant in order to ensure a continuing presence of this beauty in the garden. Furcraea foetida 'Mediopicta' brings an exotic look to the landscape and makes a dramatic focal point in sunny borders or decorative containers. Grows up to 4-5 ft. tall (120-150 cm) and 6-8 ft. wide (120-180 cm).Easily grown in rich, well-drained soils in ltered light. Needs protection from scorching sun, frost or wind. Irrigate little. Heat, humidity and drought tolerant.",
        "Utility": "These are great for beds and borders, city gardens, rock gardens, succulent gardens or Mediterranean gardens. Ideal as an accent plant in sunny borders or in decorative containers.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 62,
        "Scientific_Name": "Ficus benjamina",
        "Common_Name": "Weeping fig, Benjamin fig",
        "Family": "Moraceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "Ficus benjamina is a tree reaching 30 metres (98 ft) tall in natural conditions, with gracefully drooping branchlets and glossy leaves 6–13 cm (2–5 in), oval with an acuminate tip. In its native range, its small fruit are favored by some birds, such as the superb fruit dove, wompoo fruit dove, pink-spotted fruit dove, ornate fruit dove, orange-bellied fruit dove, Torresian imperial pigeon, purple-tailed imperial pigeon .",
        "Utility": "Ficus benjamina is a very popular houseplant in temperate areas, due to its elegant growth and tolerance of poor growing conditions; it does best in bright, sunny conditions but will also tolerate considerable shade. It requires a moderate amount of watering in summer, and only enough to keep it from drying out in the winter. It does not need to be misted. The plant is sensitive to cold and should be protected from strong drafts. When grown indoors, it can grow too large for its situation, and may need drastic pruning or replacing. Ficus benjamina has been shown to effectively remove gaseous formaldehyde from indoor air.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 63,
        "Scientific_Name": "Ficus benghalensis",
        "Common_Name": "Banyan, Banyan fig, Indian banyan, Marri chettu",
        "Family": "Moraceae",
        "Leaf_Shape": "Elliptical",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "Banyan trees are one of the largest trees in the world and grow up to 20-25 m with branches spreading up to 100 m. it has a massive trunk that has smooth greyish brown bark and is fluted. They have very powerful roots that can penetrate very hard surfaces like concrete and even stones sometimes. Older banyan trees are characterized by emergence of aerial prop roots that are thin and fibrous when new, but develop into thick branchlike appearance once they are old and firmly rooted onto the soil. These aerial prop roots offer support to the huge canopy of the tree. The banyan tree generally grows around an existing tree for initial support and drives it roots within it. As the banyan tree matures, the mesh of roots exerts tremendous pressure on the support tree, it eventually dies and the remains rot away leaving a hollow central column inside the main tree trunk. Leaves are thick and stout with small petioles. The leaf buds are covered by two lateral scales which fall off when the leaf matures. The leaves are glabrous on the upper surface and covered in small, fine, stiff hairs on the underside. Shape of the leaf lamina is coriaceous, ovate or orb ovate to elliptic. Dimensions of the leaves are about 10-20 cm in length and 8-15 cm in breadth. The flowers grow within a special type of inflorescence called Hypanthodium that is characteristic of Fig family trees. It is sort of a receptacle which encloses both the male and the female flowers with an opening on top known as the ostioles. The fruits of the banyan trees are types of figs that are globose to depressed-globose, 15-2.5 cm in diameter and pinkish-red in color, with some external hairs present.",
        "Utility": "The fruits are edible and nutritious. They are also used to soothe skin irritations and alleviate swelling. The bark and leaf extracts are used to arrest bleeding. Infusion of the leaf buds are used to treat chronic diarrhea/dysentery. Few drops of the latex help relieve bleeding piles. Young banyan tree roots are used to treat female sterility. Use of the aerial roots to clean teeth helps prevent gum and teeth problems. Application of the latex is beneficial for curing rheumatism, joint pain and lumbago, as well as to heal sores and ulcers. Infusion of barks is used to relieve nausea. The banyan tree is known to produce shellac which is used as a surface polisher and adhesive. It is produced primarily by lac producing insects that reside in the banyan tree. The milk sap is used to polish metals such as brass or copper. The wood is often used as firewood.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 64,
        "Scientific_Name": "Pentas lanceolata",
        "Common_Name": "Pentas, Star flower, Star cluster",
        "Family": "Rubiaceae",
        "Leaf_Shape": "Elliptical",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "Pentas lanceolata, commonly called Egyptian star cluster or star flower, is native from Yemen to East Africa. It is a tropical woody-based perennial or subshrub that grows 3-6’ tall in its native habitat, but more typically to 1-2’ tall in beds or containers in the St. Louis area. It is a many-branched, somewhat sprawling plant that features 4” wide rounded clusters (corymbs) of star-shaped flowers over a long summer to frost bloom. Elliptic to lanceolate dark green leaves (to 6” long). Flowers are pink, magenta, lilac or less commonly white.",
        "Utility": "This is used as a garden plant.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 65,
        "Scientific_Name": "DRACAENA marginata 'Colorama'",
        "Common_Name": "Colorama Dracaena, Madagascar Dragon Tree, Dragon tree",
        "Family": "Agavaceae",
        "Leaf_Shape": "Lanceolate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "\"Tufts of pointed leaves atop distinctly chevron-marked stems define the alien-looking Dragon Tree. Native to Madagascar, Dracaena marginata is the classic houseplant for most locations. Very cold sensitive, dragon tree is grown in the landscape in only the warmest regions. The leaves are long, linear, narrow, attached to the stem without a stalk. The cultivar ‘Colorama’ has green leaves with red-pink stripes on the margins, midrib and either side of the midrib.The stems or trunks usually are un-branched when young, eventually branching when mature to form spreading, vase-shaped trees. Flowers are fragrant, small, produced on stalks at the ends of the stems and followed by yellow-orange berries. Flowers and fruit are rarely produced on houseplants.\n\nDragon trees grown as house plants likes bright indirect light, though will tolerate low light, the foliage will be less bright. Well-drained soil and high humidity are also required indoors; setting the container on a tray of moist pebbles will help keep the humidity high. Keep the soil evenly moist, but not wet; excess drying or water will cause leaf tips to turn brown. In the landscape, plant in partly sunny to partial shade locations with well drained soil. Dragon trees are easily pruned and propagated by removing a tuft of leaves and rooting the branch.\"",
        "Utility": "These are used as house plants.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 66,
        "Scientific_Name": "Colocasia esculenta",
        "Common_Name": "Colocasia,Taro, Elephant’s ear",
        "Family": "Araceae",
        "Leaf_Shape": "Cordate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "The plant has rhizomes of different shapes and sizes. Leaves are up to 40 × 24.8 cm and sprout from the rhizome. They are dark green above and light green beneath, triangular-ovate, sub-rounded and mucronate at the apex, with the tip of the basal lobes rounded or sub-rounded. The petiole is 0.8–1.2 m high. The path can be up to 25 cm long. The spadix is about three fifths as long as the spathe, with flowering parts up to 8 mm in diameter. The female portion is at the fertile ovaries intermixed with sterile white ones. Neuters grow above the females, and are rhomboid or irregular oblong in shape. The male portion is above the neuter. Leaves are synandrium lobed, with six or eight cells. The appendage is shorter than the male portion.",
        "Utility": "\"consumption of its edible corm and leaves. In its raw form, the plant is toxic due to the presence of calcium oxalate, and the presence of needle-shaped raphides in the plant cells. However, the toxin can be minimized and the tuber rendered palatable by cooking, or by steeping in cold water overnight.\n\nCorms of the small round variety are peeled and boiled, sold either frozen, bagged in its own liquids, or canned. The leaves are rich in vitamins and minerals. It is also sold as an ornamental aquatic plant.\n\nIt is also used for anthocyanin study experiments especially with reference to abaxial and adaxial anthocyanic concentration.\n\nThe corms, which have a light purple color due to phenolic pigments, are roasted, baked or boiled, and the natural sugars give a sweet nutty flavor. The starch is easily digestible, and since the grains are fine and small it is often used for baby food. Young taro leaves and stems can be eaten after boiling twice to remove the acrid flavor, and the leaves are a good source of vitamins A and C and contain more protein than the corms.\"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 67,
        "Scientific_Name": "Allamanda cathartica",
        "Common_Name": "Golden trumpet, Yellow allamanda",
        "Family": "Apocynaceae",
        "Leaf_Shape": "Elliptical",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "A tropical twining vine, native to Brazil, with deeply veined, whorled leaves and large, trumpet shaped bright yellow flowers. Prickly seed pods follow the flowers with winged seeds that fly about when the pod dries and breaks open. The Allamanda vine is a fast growing rampant vine that always looks better with training and pruning. It flowers almost all year. The plant has milky sap and is considered poisonous; all parts are highly cathartic (hence the botanical name) Texture is coarse and leaves are bright to light green; the plant is often pruned and used as a shrub.",
        "Utility": "The plant was introduced to many countries due to its ornamental purposes.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 68,
        "Scientific_Name": "Cassia fistula L.",
        "Common_Name": "Golden Rain Tree, రేల, கொன்றை, കർണ്ണികാരം",
        "Family": "Fabaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Compound",
        "Description": "The golden shower tree is a medium-sized tree, growing to 10–20 m tall with fast growth. The leaves are deciduous, 15–60 cm long, and pinnate with three to eight pairs of leaflets, each leaflet 7–21 cm long and 4–9 cm broad. The flowers are produced in pendulous racemes 20–40 cm long, each flower 4–7 cm diameter with five yellow petals of equal size and shape. The fruit is a legume, 30–60 cm long and 1.5–2.5 centimetres broad, with a pungent odor and containing several seeds.",
        "Utility": "In Ayurvedic medicine, the golden shower tree is known as aragvadha, meaning \"disease killer\". The fruit pulp is considered a purgative, and self-medication or any use without medical supervision is strongly advised against in Ayurvedic texts. Though it has been used in herbalism for millennia, little research has been conducted in modern times although it is an ingredient in some mass-produced herbal laxatives.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 69,
        "Scientific_Name": "Nerium oleander L.",
        "Common_Name": "Oleander, Ganneru",
        "Family": "Apocynaceae",
        "Leaf_Shape": "Lanceolate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "Oleander grows to 2–6 m tall, with erect stems that splay outward as they mature; first-year stems have a glaucous bloom, while mature stems have a grayish bark. The leaves are in pairs or whorls of three, thick and leathery, dark-green, narrow lanceolate, 5–21 cm long and 1–3.5 cm broad, and with an entire margin filled with minute reticulate venation web typical of Eudicots. Leaves are light green and very glossy when young, before maturing to a dull dark green/greenish gray. The flowers grow in clusters at the end of each branch; they are white, pink to red, 2.5–5 cm diameter, with a deeply 5-lobed fringed corolla round the central corolla tube. They are often, but not always, sweet-scented. The fruit is a long narrow pair of follicles 5–23 cm long, which splits open at maturity to release numerous downy seeds.",
        "Utility": "\"Oleander is a vigorous grower in warm subtropical regions, where it is extensively used as an ornamental plant in parks, along roadsides and in private gardens. It is most commonly grown in its natural shrub form, but can be trained into a small tree with a single trunk. \nDrugs derived from N. oleander have been investigated as a treatment for cancer, unsuccessfully. According to the American Cancer Society, the trials conducted so far have produced no evidence of benefit, while they did cause adverse side effects.\"",
        "Common_diseases_and_Pests": "Leaf scorch"
      },
      {
        "Id": 70,
        "Scientific_Name": "Delonix regia (Boj. ex Hook.) Raf.",
        "Common_Name": "Royal poinciana, गुलमहोर (Gulmohar), കാൽവരിപ്പൂവ് (kaalvarippoo)",
        "Family": "Fabaceae",
        "Leaf_Shape": "Elliptical",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Compound",
        "Description": "The flowers of Delonix regia are large, with four spreading scarlet or orange-red petals up to 8 cm long, and a fifth upright petal called the standard, which is slightly larger and spotted with yellow and white. They appear in corymbs along and at the ends of branches. The pods are green and flaccid when young and turn dark-brown and woody. They can be up to 60 cm long and 5 cm wide. The seeds are small, weighing around 0.4 g on average. The compound (doubly pinnate) leaves have a feathery appearance and are a characteristic light, bright green. Each leaf is 30–50 cm long with 20 to 40 pairs of primary leaflets or pinnae, each divided into 10–20 pairs of secondary leaflets or pinnules.",
        "Utility": "The timber is soft and light and has no other uses than for firewood. It is used as an ornamental tree.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 71,
        "Scientific_Name": "Ocimum tenuiflorum L.",
        "Common_Name": "Tulsi",
        "Family": "Lamiaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Serrate",
        "Leaf_Division": "Simple",
        "Description": "Holy basil is an erect, many-branched subshrub, 30–60 cm tall with hairy stems. Leaves are green or purple; they are simple, petioled, with an ovate, up to 5 cm -long blade which usually has a slightly toothed margin; they are strongly scented and have a decussate phyllotaxy. The purplish flowers are placed in close whorls on elongate racemes. The two main morphotypes cultivated in India and Nepal are green-leaved (Sri or Lakshmi tulasi) and purple-leaved (Krishna tulasi)",
        "Utility": "\"Tulasi has been used in Ayurveda for its supposed treatment of diseases. Traditionally, tulasi is taken as herbal tea, dried powder, fresh leaf or mixed with ghee.\nFor centuries, the dried leaves have been mixed with stored grains to repel insects.\"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 72,
        "Scientific_Name": "Mirabilis jalapa L.",
        "Common_Name": "Four o'clock flower, చంద్రకాంత(chandrakantha)",
        "Family": "Nyctaginaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "Four o'clock flowers are trumpet shaped, about an inch across at the end and about two inches long. They open in the evening and wilt the next morning. Four o'clocks are leafy, shrublike, multi-branched perennials which bloom throughout summer. The plants are erect and spreading, 2-3 ft tall and just as wide. They have numerous branches and opposite, pointed leaves 2-4 in long. The fragrant flowers are borne singly or in clusters, and can be red, magenta, pink, yellow or white, sometimes with more than one color on the same plant. Like Petunia, bicolored flowers can also be grown. The plants continue to produce new flowers from late spring untill fall. Four o'clocks have large, black carrot shaped tubers that can be a foot or more long. In warm regions, the roots can weigh up to 18 kg or more.",
        "Utility": "\"The flowers are used in food colouring. The leaves may be eaten cooked as well, but only as an emergency food.\nAn edible crimson dye is obtained from the flowers to colour cakes and jellies.\n\nIn herbal medicine, parts of the plant may be used as a diuretic, purgative, and for vulnerary (wound healing) purposes. The root is believed an aphrodisiac as well as diuretic and purgative. It is used in the treatment of dropsy.\n\nThe leaves are used to reduce inflammation. A decoction of them (mashing and boiling) is used to treat abscesses. Leaf juice may be used to treat wounds.\nPowdered, the seed of some varieties is used as a cosmetic and a dye. The seeds are considered poisonous.\n\nThe plant has a potential for the bioremediation of soils polluted with moderate concentrations of heavy metals such as cadmium.\"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 73,
        "Scientific_Name": "Bryophyllum pinnatum (Lam.) Oken",
        "Common_Name": "Air plant, Cathedral bells, Life plant, Miracle leaf, Goethe plant",
        "Family": "Crassulaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Crenate",
        "Leaf_Division": "Simple",
        "Description": "\"The upright (i.e. erect) stems are fleshy (i.e. succulent) and hairless (i.e. glabrous).\n\nThe leaves are also fleshy (i.e. succulent) and are either simple (particularly on seedlings) or compound (i.e. trifoliate or pinnate). They are oppositely arranged, flattened, and the number of leaflets present varies from one near the base of the stems to three or five (i.e. trifoliate or pinnate) higher up the stems. These leaves (5-25 cm long and 2-12.5 cm wide) are green or yellowish-green in colour, hairless (i.e. glabrous), and are borne on stalks (i.e. petioles) 2-10 cm long. The leaflets are oval or narrowly oval (i.e. elliptic) in shape with rounded tips (i.e. obtuse apices), and when more than one leaflet is present the end (i.e. terminal) leaflet is usually significantly larger than the others. Tiny plantlets may occasionally be formed in the scalloped (i.e. crenate) margins of these leaflets. These plantlets are more often produced if the leaves become detached from the stems.\"",
        "Utility": "\"In common with other Crassulaceae (such as the genera Tylecodon, Cotyledon and Adromischus), Bryophyllum pinnatum has been found to contain bufadienolide cardiac glycosides These can cause cardiac poisoning, particularly in grazing animals.\n\nBryophyllum pinnatum has been recorded in Trinidad and Tobago as being used as a traditional treatment for hypertension. In traditional medicine, the juice of the leaves is also used to cure kidney stones, although there is no scientific evidence for this use, and, indeed, such usage could prove dangerous and even fatal in some cases.\"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 74,
        "Scientific_Name": "Fagraea ceilanica Thunb.",
        "Common_Name": "Perfume Flower Tree,  മരുന്തൻകാമരം (marunthankaamaram), മോടകം (motakam), വെള്ളമോടകം (vellamotakam )",
        "Family": "Gentianaceae",
        "Leaf_Shape": "Lanceolate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "Leaves are fleshy, shiny and typically lanceolate, 100-180 x 50–80 mm, with a petiole to 25 mm long. The inflorescence is terminal or axillary, few-flowered (see illustration). Flowers are 60–80 mm cream/white typically in March–August. The calyx is 5-lobed each approx. 8 mm long. The funnel-shaped corolla is 40–50 mm long with five broad lobes, twisted to right, and 5 adnate stamens are attached to base. A capitate stigma is attached to the ovary, which is 2-celled and containing many ovules in each. Fruiting is typically in August–November; structurally they are shiny berries and containing many seeds.",
        "Utility": "Typical habitat is seasonal tropical forest, but it is also grown as an ornamental tree in many places in India",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 75,
        "Scientific_Name": "Terminalia catappa L.",
        "Common_Name": "Country-almond, Indian-almond, Malabar-almond, Sea-almond, Tropical-almond",
        "Family": "Combretaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "\"The tree grows to 35 m tall, with an upright, symmetrical crown and horizontal branches. Terminalia catappa has corky, light fruit that are dispersed by water. \nThe seed within the fruit is edible when fully ripe, tasting almost like almond. As the tree gets older, its crown becomes more flattened to form a spreading, vase shape. Its branches are distinctively arranged in tiers. The leaves are large, 15–25 cm  long and 10–14 cm broad, ovoid, glossy dark green, and leathery. They are dry-season deciduous; before falling, they turn pinkish-reddish or yellow-brown, due to pigments such as violaxanthin, lutein, and zeaxanthin.\nThe trees are monoecious, with distinct male and female flowers on the same tree. Both are 1 cm  in diameter, white to greenish, inconspicuous with no petals; they are produced on axillary or terminal spikes. The fruit is a drupe 5–7 cm  long and 3–5.5 cm  broad, green at first, then yellow and finally red when ripe, containing a single seed.\"",
        "Utility": "\"The fruit is edible, tasting slightly acidic.\n\nThe wood is red and solid, and has high water resistance; it has been used in Polynesia for making canoes. In Tamil, almond is known as nattuvadumai.\n\nThe leaves contain several flavonoids (such as kaempferol or quercetin), several tannins (such as punicalin, punicalagin or tercatin), saponines and phytosterols. Due to this chemical richness, the leaves (and the bark) are used in different herbal medicines for various purposes. For instance in Taiwan, fallen leaves are used as an herb to treat liver diseases. In Suriname, an herbal tea made from the leaves has been prescribed against dysentery and diarrhea. The leaves may contain agents for prevention of cancers (although they have no demonstrated anticarcinogenic properties) and antioxidants, as well as anticlastogenic characteristics. Extracts of T. catappa have shown activity against Plasmodium falciparum chloroquine (CQ)-resistant (FcB1) and CQ-sensitive (HB3) strains.\n\nKeeping the leaves in an aquarium may lower the pH and heavy-metal content of the water.[citation needed] It has been used in this way by fish breeders for many years, and is active against some parasites and bacterial pathogens. It is also believed to help prevent fungus forming on the eggs of the fish.\"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 76,
        "Scientific_Name": "Murraya koenigii (L.) Sprengel",
        "Common_Name": "Curry leaf",
        "Family": "Rutaceae",
        "Leaf_Shape": "Lanceolate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Compound",
        "Description": "It is a small tree, growing 4–6 m (13–20 feet) tall, with a trunk up to 40 cm (16 in) diameter. The aromatic leaves are pinnate, with 11–21 leaflets, each leaflet 2–4 cm (0.79–1.57 in) long and 1–2 cm (0.39–0.79 in) broad. The plant produces small white flowers which can self-pollinate to produce small shiny-black berries containing a single, large viable seed. Though the berry pulp is edible—with a sweet but medicinal flavour—in general, neither the pulp nor seed is used for culinary purposes.",
        "Utility": "\"The leaves are valued as seasoning in southern and west-coast Indian cooking, and Sri Lankan cooking, usually fried along with the chopped onion in the first stage of the preparation. They are also used to make thoran, vada, rasam and kadhi. They are also available dried, though the aroma is largely inferior.\n\nThe leaves of Murraya koenigii are also used as an herb in Ayurvedic medicine in which they are believed to possess anti-diabetic properties, but there is no high-quality scientific evidence for such effects. In the absence of tulsi leaves, curry leaves are used for rituals, such as pujas.\"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 77,
        "Scientific_Name": "Costus pictus",
        "Common_Name": "Painted Spiral Ginger, Spotted Spiral Ginger, Insulin plant",
        "Family": "Costaceae",
        "Leaf_Shape": "Lanceolate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "Painted Spiral Ginger is a perennial herb, native to Mexico. It has long narrow leaves with a characteristic wavy edges. The bases of the sheaths are mottled with markings that have earned the plant the synonym of Costus hieroglyphica. The inflorescences form both at the end of a leafy stem, and less often radically on a short nearly leafless stem. Painted Spiral Ginger can be recognized by its yellow flowers with red spots and stripes. In India it is grown in gardens as ornamental plant especially in Kerala in every home. The major attraction of this plant is its stem with spiral leaves and light airy and tissue paper like flowers. Red painted stem enhances the beauty of the glossy leaves and strongly spiralling canes.",
        "Utility": "The Costus pictus is valued mainly for its tonic, stimulant and antiseptic properties. It is said to be aphrodisiac and to be able to prevent the hair turning grey. Its root is anodyne, antibacterial, antispasmodic, aphrodisiac, carminative, skin, stimulant, stomachic, tonic and vermifuge.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 78,
        "Scientific_Name": "Citrus × sinensis (L.) Osbeck",
        "Common_Name": "Orange, kamala",
        "Family": "Rutaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Compound",
        "Description": "While the leaves of many relatives of citrus are distinctly compound — ranging from trifoliolate (e.g., Poncirus trifoliata) to palmately compound (e.g., Casimiroa spp.) to pinnately compound (e.g., Citropsis gilletiana) — the leaves of cultivated citrus are described as unifoliolate rather than simple, being the result of a reduction in number of leaflets. Most leaves of cultivated citrus consist of a petiole that is variously winged or not and a single, terminal leaflet. Most leaflets are somewhat toothed at the margins, although the extent and sharpness may vary. The leaves of most cultivated citrus taxa are somewhat to strongly conduplicate when in full sun. Under shade conditions however, leaves of many of the major groups, including sweet oranges, sour oranges, blood oranges, pummelos, grapefruits, etc., are more or less plane or only very slightly conduplicate. A very few cultivars exhibit leaves that are strongly conduplicate even in shade. In full sun, leaf margins tend to be somewhat undulate or wavy. Only a few cultivars exhibit leaves that are consistently wavy even in the shade.",
        "Utility": "The orange fruit is an important agricultural product, used for both the juicy fruit pulp and the aromatic peel (rind). Orange blossoms (the flowers) are used in several different ways, as are the leaves and wood of the tree.",
        "Common_diseases_and_Pests": "Giant swallowtail larva"
      },
      {
        "Id": 79,
        "Scientific_Name": "Millettia pinnata (L.) Panigrahi",
        "Common_Name": "Indian beech, Pongam oiltree, కానుగ(kanuga), புங்கை(Pungai)",
        "Family": "Fabaceae",
        "Leaf_Shape": "Oblong",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "Pongamia pinnata (L.) Pierre is a legume tree that grows to about 15–25 metres (50–80 ft) in height with a large canopy which spreads equally wide. It may be deciduous for short periods. It has a straight or crooked trunk, 50–80 centimetres (20–30 in) in diameter, with grey-brown bark which is smooth or vertically fissured. Branches are glabrous with pale stipulate scars. The imparipinnate leaves of the tree alternate and are short-stalked, rounded or cuneate at the base, ovate or oblong along the length, obtuse-acuminate at the apex, and not toothed on the edges. They are a soft, shiny burgundy when young and mature to a glossy, deep green as the season progresses with prominent veins underneath.",
        "Utility": "It is often used for landscaping purposes as a windbreak or for shade due to the large canopy and showy fragrant flowers. The flowers are used by gardeners as compost for plants requiring rich nutrients. The bark can be used to make twine or rope and it also yields a black gum that has historically been used to treat wounds caused by poisonous fish. The wood is said to be beautifully grained but splits easily when sawn thus relegating it to firewood, posts, and tool handles.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 80,
        "Scientific_Name": "Senna alata (L.) Roxb.",
        "Common_Name": "Candle bush, Candle tree",
        "Family": "Fabaceae",
        "Leaf_Shape": "Elliptical",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Compound",
        "Description": "\"The shrub stands 3–4 metres (9.8–13.1 ft) tall, with leaves 50–80 centimetres (20–31 in) long.\n\nThe leaves close in the dark.\n\nThe inflorescence looks like a yellow candle.\n\nThe fruit, shaped like a straight pod, is up to 25 cm long. Its seeds are distributed by water or animals.\n\nThe seed pods are nearly straight, dark brown or nearly black, about 15 centimetres (5.9 in) long, and 15 millimetres (0.59 in) wide. On both sides of the pods is a wing that runs the length of the pod. Pods contain 50 to 60 flattened, triangular seeds.\"",
        "Utility": "\"Senna alata (also known as Cassia alata) is often called the ringworm bush because of its very effective fungicidal properties, for treating ringworm and other fungal infections of the skin. The leaves are ground in a mortar to obtain a kind of \"\"green cotton wool\"\". This is mixed with the same amount of vegetable oil and rubbed on the affected area two or three times a day. A fresh preparation is made every day. Its active ingredients include the yellow chrysophanic acid.\n\nIts laxative effect, due to its anthraquinone content, is also well proven.\n\nSenna alata is locally known as akapulko in the Philippines where it is used as both an ornamental and medicinal plant due to its laxative, purgative and anti-fungal properties.\n\nIn Sri Lanka, known as Ath-thora (ඇත්තෝර ), it is used as an ingredient in Sinhala traditional medicine.\"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 81,
        "Scientific_Name": "Cissus quadrangularis L.",
        "Common_Name": "Devil's backbone, Nalleru",
        "Family": "Vitaceae",
        "Leaf_Shape": "Linear",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "Cissus quadrangularis reaches a height of 1.5 m and has quadrangular-sectioned branches with internodes 8 to 10 cm long and 1.2 to 1.5 cm wide. Along each angle is a leathery edge. Toothed trilobe leaves 2 to 5 cm wide appear at the nodes. Each has a tendril emerging from the opposite side of the node. Racemes of small white, yellowish, or greenish flowers; globular berries are red when ripe.",
        "Utility": "Cissus quadrangularis has been used as a medicinal plant since antiquity.Cissus has been used in various Ayurvedic classical medicines to heal broken bones and injured ligaments and tendons. In siddha medicine it is considered a tonic and analgesic, and is believed to help heal broken bones, thus its name asthisamharaka (that which prevents the destruction of bones). The Assamese people and the Garo tribe of Meghalaya and Bangladesh have used C. quadrangularis as a medicinal plant for bone fracture.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 82,
        "Scientific_Name": "Prosopis juliflora (Sw.) DC.",
        "Common_Name": "Angrezi Babul,mulla tumma (ముల్ల తుమ్మ), Junglee Kikar",
        "Family": "Fabaceae",
        "Leaf_Shape": "Elliptical",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Compound",
        "Description": "\"The mesquite tree grows to a height of up to 12 metres (39 ft) and has a trunk with a diameter of up to 1.2 metres (3.9 ft). Its leaves are deciduous, bi-pinnate, light green, compounded with 12 to 20 leaflets. Flowers appear shortly after leaf development. The flowers are in 5–10 cm long green-yellow cylindrical spikes, which occur in clusters of 2 to 5 at the ends of branches. Pods are 20 to 30 cm long and contain between 10 and 30 seeds per pod. A mature plant can produce hundreds of thousands of seeds. Seeds remain viable for up to 10 years. The tree reproduces by way of seeds, not vegetatively. Seeds are spread by cattle and other animals that consume the seed pods and spread the seeds in their droppings.\n\nIts roots are able to grow to a great depth in search of water: in 1960, they were discovered at a depth of 53 meters (175 feet) at an open-pit mine near Tucson, Arizona, putting them among the deepest known roots. The tree is said to have been introduced to Sri Lanka in the 19th century, where it is now known as vanni-andara, or katu andara in Sinhala. It is claimed that P. julifllora existed and was recognised even as a holy tree in ancient India, but this is most likely a confusion with Prosopis cineraria. The tree is believed to have existed in the Vanni and Mannar regions for a long time. This species has thorns in pairs at the nodes but thornless internodes. It may also be almost thornless.\"",
        "Utility": "Its uses include forage, wood and environmental management. The plant possesses an unusual amount of the flavanol (-)-mesquitol in its heartwood.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 83,
        "Scientific_Name": "Mimosa pudica L.",
        "Common_Name": "Dormilones, Touch-me-not",
        "Family": "Fabaceae",
        "Leaf_Shape": "Elliptical",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Compound",
        "Description": "\"The stem is erect in young plants, but becomes creeping or trailing with age. It can hang very low and become floppy. The stem is slender, branching, and sparsely to densely prickly, growing to a length of 1.5 m (5 ft).\n\nThe leaves are bipinnately compound, with one or two pinnae pairs, and 10–26 leaflets per pinna. The petioles are also prickly. Pedunculate (stalked) pale pink or purple flower heads arise from the leaf axils in mid summer with more and more flowers as the plant gets older. The globose to ovoid heads are 8–10 mm in diameter (excluding the stamens). On close examination, it is seen that the floret petals are red in their upper part and the filaments are pink to lavender. The fruit consists of clusters of 2–8 pods from 1–2 cm long each, these being prickly on the margins. The pods break into 2–5 segments and contain pale brown seeds some 2.5 mm long. The flowers are insect pollinated and wind pollinated. The seeds have hard seed coats which restrict germination and make osmotic pressure and soil acidity less significant hindrances. High temperatures are the main stimuli that cause the seeds to end dormancy.\"",
        "Utility": "\"The species can be a weed for tropical crops, particularly when fields are hand cultivated. Crops it tends to affect are corn, coconuts, tomatoes, cotton, coffee, bananas, soybeans, papaya, and sugar cane. Dry thickets may become a fire hazard. In some cases it has become a forage plant although the variety in Hawaii is reported to be toxic to livestock.\n\nIn addition, Mimosa pudica can change the physico-chemical properties of the soil it invades. For example, the total N and K increased in significantly invaded areas.\"",
        "Common_diseases_and_Pests": "Mimosa webworm"
      },
      {
        "Id": 84,
        "Scientific_Name": "Phoenix sylvestris ROXB.",
        "Common_Name": "Etha, Kanjoor",
        "Family": "ARECACEAE",
        "Leaf_Shape": "Linear",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Compound",
        "Description": "Phoenix sylvestris ranges from 4 to 15 m in height and 40 cm in diameter; not as large as the Canary Island Date Palm, but nearly so, and resembling it. The leaves are 3 m long, gently recurved, on 1 m petioles with acanthophylls near the base. The leaf crown grows to 10 m wide and 7.5 to 10 m tall containing up to 100 leaves. The inflorescence grows to 1 metre with white, unisexual flowers forming to a large, pendent infructescence. The single-seeded fruit ripens to a purple-red colour.",
        "Utility": "The fruit from this palm species is used to make wine and jelly. The sap is tapped and drunk fresh or fermented into toddy. The fresh sap is boiled to make palm jaggery in West Bengal state of India and Bangladesh.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 85,
        "Scientific_Name": "Bixa orellana L.",
        "Common_Name": "Lipstic tree",
        "Family": "Bixaceae",
        "Leaf_Shape": "Cordate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "Bixa orellana is a tall shrub to small evergreen tree 6–10 m (20–33 ft) high. It bears clusters of 5 cm (2 in) bright white to pink flowers, resembling single wild roses, appearing at the tips of the branches. The fruits are in clusters: spiky looking red-brown seed pods covered in soft spines. Each pod contains many seeds covered with a thin waxy blood-red aril. When fully mature, the pod dries, hardens, and splits open, exposing the seeds.",
        "Utility": "The tree is best known as the source of annatto, a natural orange-red condiment (also called \"achiote\" or \"bijol\") obtained from the waxy arils that cover its seeds. The ground seeds are widely used in traditional dishes in Central and South America, Mexico, and the Caribbean, such as cochinita pibil, chicken in achiote and caldo de olla. Annatto and its extracts are also used as an industrial food coloring to add yellow or orange color to many products such as butter, cheese, sausages, cakes, and popcorn.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 86,
        "Scientific_Name": "Jasminum sambac (L.) Aiton",
        "Common_Name": "Arabian Jasmine",
        "Family": "Oleaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "\"Jasminum sambac is an evergreen vine or shrub reaching up to 0.5 to 3 m (1.6 to 9.8 ft) tall. The species is highly variable, possibly a result of spontaneous mutation, natural hybridization, and autopolyploidy. Cultivated Jasminum sambac generally do not bear seeds and the plant is reproduced solely by cuttings, layering, marcotting, and other methods of asexual propagation.\n\nThe leaves are ovate, 4 to 12.5 cm (1.6 to 4.9 in) long and 2 to 7.5 cm (0.79 to 2.95 in) wide. The phyllotaxy is opposite or in whorls of three, simple (not pinnate, like most other jasmines). They are smooth (glabrous) except for a few hairs at the venation on the base of the leaf.\n\nThe flowers bloom all throughout the year and are produced in clusters of 3 to 12 together at the ends of branches. They are strongly scented, with a white corolla 2 to 3 cm (0.79 to 1.18 in) in diameter with 5 to 9 lobes. The flowers open at night (usually around 6 to 8 in the evening), and close in the morning, a span of 12 to 20 hours. The fruit is a purple to black berry 1 cm (0.39 in) in diameter.\"",
        "Utility": "\"The sweet, heady fragrance of Jasminum sambac is its distinct feature. It is widely grown throughout the tropics from the Arabian peninsula to Southeast Asia and the Pacific Islands as an ornamental plant and for its strongly scented flowers.\nTypically, the flowers are harvested as buds during early morning. The flower buds are harvested on basis of color, as firmness and size are variable depending on the weather. The buds have to be white, as green ones may not emit the characteristic fragrance they are known for.\"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 87,
        "Scientific_Name": "Rauvolfia serpentina (L.) Benth. ex Kurz",
        "Common_Name": "Sarpagandha, Paataala garuda",
        "Family": "Apocynaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "\"Rauwolfia serpentina is an evergreen, erect glabrous perennial shrub that normally grows up to a height of 60 cm.\n\nRoots of this herb are tuberous with a cork of a pale brown color.\n\nLeaves of this plant are generally found in whorls of three, and are bright green colored above and pale green colored below. The base of the leaves is slender and tapering in nature. The petioles of this plant are long.\n\nThe flowers are white in color, sometimes violet in color and contains nectar at the deep of the corolla tubes Peduncles are long enough while the pedicles are stout. The calyx is bright red in color. The corolla is usually longer than the calyx. Drupes of this plant are slightly connate, ovoid and are of purplish black color. The flowering period of this plant is March to May in India.\n\nIts fruit are oval fleshy and tiny which turn shiny purple-black on ripening.\"",
        "Utility": "\"The extract of the plant has been used for millennia in India. Alexander the Great administered this plant to cure his general Ptolemy I Soter of a poisoned arrow.[citation needed] It was reported that Mahatma Gandhi took it as a tranquilizer during his lifetime. The plant contains reserpine, which was used as a pharmaceutical drug in Western medicine from 1954 to 1957 to treat high blood pressure and mental disorders including schizophrenia.\n\nIt is one of the 50 fundamental herbs used in traditional Chinese medicine, where it has the name shégēn mù.\"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 88,
        "Scientific_Name": "Euphorbia tirucalli L.",
        "Common_Name": "Firestick plant, Pencil cactus, Pulla jemudu, Saptala(सप्तला)",
        "Family": "Euphorbiaceae",
        "Leaf_Shape": "Linear",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "\"It has a wide distribution in Africa, being prominently present in northeastern, central and southern Africa. It may also be native in other parts of the continent as well as some surrounding islands and the Arabian peninsula and has been introduced to many other tropical regions. Its status in India is uncertain. It grows in dry areas, and is often used to feed cattle or as hedging.\n\"",
        "Utility": "\"Euphorbia tirucalli also has uses in traditional medicine in many cultures. It has been used for cancer, excrescence, tumors, and warts in such diverse places as Brazil, India, Indonesia[citation needed], and Malaysia. It has also been used as for asthma, cough, earache, neuralgia, rheumatism, toothache, and warts in India and Malaysia.\nEuphorbia tirucalli has been promoted as an anticancer agent, but research shows that it suppresses the immune system, promotes tumor growth, and leads to the development of certain types of cancer. Euphorbia tirucalli has also been associated with Burkitt's lymphoma and is thought to be a cofactor of the disease rather than a treatment.\"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 89,
        "Scientific_Name": "Bougainvillea glabra Choisy",
        "Common_Name": "Paper flower tree",
        "Family": "Nyctaginaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "It is an evergreen, climbing shrub with thorny stems. It usually grows 10–12 ft (3.0–3.7 m) tall, occasionally up to 30 ft (9 m). Tiny white flowers usually appear in clusters surrounded by colorful papery bracts, hence the name paperflower. The leaves are dark green, variable in shape, up to 4 in (10 cm) long. The flowers are about 0.4 cm in diameter (the pink petal-like structures are not petals, but bracts.)",
        "Utility": "It is used as ornamental as B. glabra is heat and drought tolerant and frost sensitive. It is easily propagated by cuttings.",
        "Common_diseases_and_Pests": "Hypercompe scribonia"
      },
      {
        "Id": 90,
        "Scientific_Name": "Leucaena leucocephala (Lam.) de Wit",
        "Common_Name": "Subabul, Jumbay,  River tamarind",
        "Family": "Fabaceae",
        "Leaf_Shape": "Elliptical",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Compound",
        "Description": "Leucaena leucocephala is a small fast-growing mimosoid tree native to southern Mexico and northern Central America (Belize and Guatemala) and is now naturalized throughout the tropics. It has a very fast growth rate: young trees reach a height of more than 20 ft in two to three years.",
        "Utility": "\"Leucaena leucocephala has been considered for biomass production because its reported yield of foliage corresponds to a dried mass of 2,000–20,000 kg/ha/year, and that of wood 30–40 m³/ha/year, with up to twice those amounts in favorable climates.\nSubabul is the most important pulpwood species for making pulp. It has huge positive socio-economic impact on the livelihood of the small farmers where Subabul is grown as an industrial crop. \"",
        "Common_diseases_and_Pests": "Psyllids"
      },
      {
        "Id": 91,
        "Scientific_Name": "Canna 'Yellow King Humbert'",
        "Common_Name": "Canna lily",
        "Family": "Canna",
        "Leaf_Shape": "Lanceolate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "A favorite for over a century, Canna 'Yellow King Humbert' produces a profusion of immense, rich deep yellow owers, copiously splashed with ery orange. Sitting on erect, branching stalks, the brilliant blossoms contrast nicely with the lush foliage of large, lance-shaped, apple-green leaves. Blooming from mid summer to fall, this canna provides a cheerful touch of the tropics in the garden or patio. A deservedly popular variety",
        "Utility": "Canna Lilies look at their best when massed along walls or hedges or in garden beds where they proudly stand out. Spectacular on a patio, they are well suited to container growing.",
        "Common_diseases_and_Pests": "Canna Leaf Roller"
      },
      {
        "Id": 92,
        "Scientific_Name": "Datura innoxia Mill.",
        "Common_Name": "Downy thorn-apple, Indian-apple, Moon flower",
        "Family": "Solanaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "\"Datura innoxia is an annual shrubby plant that typically reaches a height of 0.6 to 1.5 metres. Its stems and leaves are covered with short and soft grayish hairs, giving the whole plant a grayish appearance. It has elliptic smooth-edged leaves with pinnate venation. All parts of the plant emit a foul odor similar to rancid peanut butter when crushed or bruised, although most people find the fragrance of the flowers to be quite pleasant when they bloom at night.\n\nThe flowers are white, trumpet-shaped, 12–19 cm (4.5–7.5 in) long. They first grow upright, and later incline downward. It flowers from early summer until late fall.\n\nThe fruit is an egg-shaped spiny capsule, about 5 cm in diameter. It splits open when ripe, dispersing the seeds. Another means of dispersal is by the fruit spines getting caught in the fur of animals, who then carry the fruit far from the mother plant. The seeds have hibernation capabilities, and can last for years in the soil. The seeds, as well as the entirety of this plant, act as deliriants, but have a high probability of overdose.\"",
        "Utility": "\"Datura innoxia, like other Datura species, contains the highly toxic alkaloids atropine, hyoscine (scopolamine), and hyoscyamine. \nDatura intoxication typically produces a complete inability to differentiate reality from fantasy (delirium, as contrasted to hallucination); hyperthermia; tachycardia; bizarre, and possibly violent behavior; and severe mydriasis with resultant painful photophobia that can last several days.\"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 93,
        "Scientific_Name": "Cucurbita maxima Duchesne",
        "Common_Name": "Pumpkin",
        "Family": "Cucurbitaceae",
        "Leaf_Shape": "Palmate",
        "Leaf_margin_edge": "Dentate",
        "Leaf_Division": "Simple",
        "Description": "Cucurbita maxima, one of at least four species of cultivated squash, is one of the most diverse domesticated species.This species originated in South America from the wild Cucurbita andreana over 4000 years ago. The two species hybridize quite readily but have noticeably different calcium levels.",
        "Utility": "\"Buttercup squash, a common cultivar, can be roasted, baked, and mashed into soups, among a variety of filler uses, much like pumpkin. It is extremely popular, especially as a soup, in Brazil and Africa.\n\nAll giant pumpkins (over 100 pounds or 45 kilograms) are of this species, including the largest pumpkins ever documented, which have attained a size of over 2,300 pounds (1,000 kg).\n\nThe seed of C. maxima is used in treating parasites in animals.\"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 94,
        "Scientific_Name": "Casuarina equisetifolia L.",
        "Common_Name": "Whistling pine",
        "Family": "Casuarinaceae",
        "Leaf_Shape": "Linear",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "\"Casuarina equisetifolia is an evergreen tree growing to 6–35 m (20–115 ft) tall. The foliage consists of slender, much-branched green to grey-green twigs 0.5–1 mm (0.020–0.039 in) diameter, bearing minute scale-leaves in whorls of 6–8. The flowers are produced in small catkin-like inflorescences; the male flowers in simple spikes 0.7–4 cm (0.28–1.57 in) long, the female flowers on short peduncles. Unlike most other species of Casuarina (which are dioecious) it is monoecious, with male and female flowers produced on the same tree. The fruit is an oval woody structure 10–24 mm (0.39–0.94 in) long and 9–13 mm (0.35–0.51 in) in diameter, superficially resembling a conifer cone made up of numerous carpels each containing a single seed with a small wing 6–8 mm (0.24–0.31 in) long.\n\nLike some other species of the Genus Casuarina, Casuarina equisetifolia is an actinorhizal plant able to fix atmospheric nitrogen. In contrast to species of the Fabaceae family of plants (e.g., beans, alfalfa, Acacia), Casuarina harbours a symbiosis with a Frankia actinomycete.\"",
        "Utility": "Casuarina is widely used as a bonsai subject, particularly in South-east Asia and parts of the Caribbean. Casuarina was also explored in for its potential in remediation of textile dye wastewater.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 95,
        "Scientific_Name": "Roystonea regia (Kunth) O.F.Cook",
        "Common_Name": "Royal palm, వక్క",
        "Family": "Arecaceae",
        "Leaf_Shape": "Lanceolate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Compound",
        "Description": "Roystonea regia is a large palm which reaches a height of 20–30 metres (66–98 ft) tall, (with heights up to 34.5 m (113 ft) reported) and a stem diameter of about 47 centimetres (19 in). (K. F. Connor reports a maximum stem diameter of 61 cm (24 in).) The trunk is stout, very smooth and grey-white in colour with a characteristic bulge below a distinctive green crownshaft. Trees have about 15 leaves which can be up to 4 m (13 ft) long. The flowers are white with pinkish anthers. The fruit are spheroid to ellipsoid in shape, 8.9–15 millimetres (0.35–0.59 in) long and 7–10.9 mm (0.28–0.43 in) wide. They are green when immature, turning red and eventually purplish-black as they mature.",
        "Utility": "Roystonea regia has been planted throughout the tropics and subtropics as an ornamental. The seed is used as a source of oil and for livestock feed. Leaves are used for thatching and the wood for construction. The roots are used as a diuretic, and for that reason they are added to tifey, a Haitian drink, by Cubans of Haitian origin. They are also used as a treatment for diabetes.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 96,
        "Scientific_Name": "Euphorbia pulcherrima Willd. ex Klotzsch",
        "Common_Name": "Poinsettia",
        "Family": "Euphorbiaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Dentate",
        "Leaf_Division": "Simple",
        "Description": "Euphorbia pulcherrima is a shrub or small tree, typically reaching a height of 0.6–4 metres (2–13 ft). The plant bears dark green dentate leaves that measure 7–16 centimetres (2.8–6.3 in) in length. The colored bracts—which are most often flaming red but can be orange, pale green, cream, pink, white, or marbled—are often mistaken for flower petals because of their groupings and colors, but are actually leaves. The colors of the bracts are created through photoperiodism, meaning that they require darkness (12 hours at a time for at least five days in a row) to change color. At the same time, the plants require abundant light during the day for the brightest color.",
        "Utility": "The Aztecs used the plant to produce red dye and as an antipyretic medication. Poinsettias are popular Christmas decorations in homes, churches, offices, and elsewhere across North America.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 97,
        "Scientific_Name": "Dieffenbachia seguine (Jacq.) Schott",
        "Common_Name": "Dumbcane",
        "Family": "Araceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "The herbaceous perennial grows 3 feet (0.91 m) to 10 feet (3.0 m) in height and 2 feet (0.61 m) to 3 feet (0.91 m) in width.[2] The plant's leaves are large and green, and often with variegated white patterns. Like other Dieffenbachias, the sap is toxic. It has showy white flowers.",
        "Utility": "Dieffenbachia seguine is cultivated as an ornamental plant in temperate shade gardens and as a potted house plant.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 98,
        "Scientific_Name": "Petroselinum crispum (Mill.) Fuss",
        "Common_Name": "Garden parsley, Flat parsley",
        "Family": "Apiaceae",
        "Leaf_Shape": "Palmate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Compound",
        "Description": "Garden parsley is a bright green, biennial plant in temperate climates, or an annual herb in subtropical and tropical areas.\n\nWhere it grows as a biennial, in the first year, it forms a rosette of tripinnate leaves 10–25 cm long with numerous 1–3 cm leaflets, and a taproot used as a food store over the winter. In the second year, it grows a flowering stem to 75 cm (30 in) tall with sparser leaves and flat-topped 3–10 cm diameter umbels with numerous 2 mm diameter yellow to yellowish-green flowers. The seeds are ovoid, 2–3 mm long, with prominent style remnants at the apex. One of the compounds of the essential oil is apiol. The plant normally dies after seed maturation.",
        "Utility": "Parsley is widely used in Middle Eastern, European, Brazilian, and American cooking. It is also grown as an ornamental plant.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 99,
        "Scientific_Name": "CORDYLINE fruticosa 'Red Sister'",
        "Common_Name": "Good Luck Tree, Hawaiian Ti, Red Sister Ti, Tiplant",
        "Family": "Liliaceae",
        "Leaf_Shape": "Linear",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "\"Red Sister' develops pink, plum, maroon and deep burgundy foliage. Hawaiian ti (pronounced \"\"tee\"\") is a broadleaf evergreen shrub, resembling a short palm that is native to tropical Southeast Asia. Unbranched stems support strap-like leaves. More intense colors are produced in full sun, however this cultivar should not be in intense hot sunlight during the middle of the day. The ti plant is clump forming and sometimes suckering, though not invasive. In temperate regions, it is frequently grown as a houseplant.\n\nOutdoors, ensure Red Sister ti grows in a moist soil and in a partial sun to partial shade location for the best foliage condition. Protect it from reflected heat and light off of sidewalks and asphalt. Humidity give the leaves a fresher, slightly glossy complexion.\"",
        "Utility": "It is grown as an ornamental plant",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 100,
        "Scientific_Name": "Epipremnum aureum (Linden and André) G.S.Bunting",
        "Common_Name": "golden pothos, hunter's robe, ivy arum, money plant, silver vine, Solomon Islands ivy, taro vine",
        "Family": "Araceae",
        "Leaf_Shape": "Cordate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "E. aureum is an evergreen vine growing to 20 m (66 ft) tall, with stems up to 4 cm (2 in) in diameter, climbing by means of aerial roots which adhere to surfaces. The leaves are alternate, heart-shaped, entire on juvenile plants, but irregularly pinnatifid on mature plants, up to 100 cm (39 in) long and 45 cm (18 in) broad; juvenile leaves are much smaller, typically under 20 cm (8 in) long. The flowers are produced in a spathe up to 23 cm (9 in) long. This plant produces trailing stems when it climbs up trees and these take root when they reach the ground and grow along it. The leaves on these trailing stems grow up to 10 cm (4 in) long and are the ones normally seen on this plant when it is cultivated as a potted plant.",
        "Utility": "\"In temperate regions it is a popular houseplant and is often used in decorative displays in shopping centers, offices, and other public locations largely because it requires little care and is also attractively leafy. \nThe plant is also efficient at removing indoor pollutants such as formaldehyde, xylene, and benzene.\nThe plant is sometimes used in aquariums, placed on top of the aquarium and allowed to grow roots in the water. \"",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 101,
        "Scientific_Name": "COLOCASIA esculenta 'Diamond Head'",
        "Common_Name": "Elephant Ear, Taro",
        "Family": "Araceae",
        "Leaf_Shape": "Peltate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "Also called elephant year, Colocasia esculenta produces huge arrow-shaped leaves held on tall leaf stems that arise directly from the corm. The leaf stem attaches to the leaf centrally. This stem attachment is known as “peltate” and is one of the characteristics used to identify Colocasia species. The similar looking leaves of Alocasia and Xanthosoma have leaf stems that attach along the edge of the leaf. Taro flowers are often hidden by the foliage, but the fragrant, calla lily-like flowers are creamy-yellow and appear sporadically in summer. The flowers are occasionally followed by columns of red or orange berry like fruits.",
        "Utility": "It is used as an ornamental plant.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 102,
        "Scientific_Name": "Allamanda blanchetii A.DC.",
        "Common_Name": "purple allamanda, violet allamanda",
        "Family": "Apocynaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "Plants of the genus are evergreen trees,[3] shrubs, or vines.[5] They contain a white latex. The leaves are opposite or arranged in whorls of up to 5. The blades are generally oval and smooth-edged, and some are leathery or lightly hairy. The inflorescence is a compound cyme. The flower has five lobed sepals and a bell- or funnel-shaped corolla of five petals, yellow in most species. The fruit is a schizocarp containing two to four seeds.",
        "Utility": "In lab analyses Allamanda species have yielded several chemical compounds, including iridoid lactones such as allamandin, plumericin, and plumierides. Allamanda species have been used in systems of traditional medicine for various purposes.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 103,
        "Scientific_Name": "Euphorbia tithymaloides L.",
        "Common_Name": "devil's-backbone, buck-thorn, cimora misha, christmas candle, fiddle flower, ipecacuahana, Jacob's ladder, Japanese poinsettia, Jew's slipper, Jewbush, milk-hedge, myrtle-leaved spurge, Padus-leaved clipper plant, red slipper spurge, redbird cactus, slipper flower, slipper plant, slipper spurge, timora misha, zig-zag plant.",
        "Family": "Euphorbiaceae",
        "Leaf_Shape": "Accuminate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "\"The shrub can grow to 6 to 8 feet (1.8 to 2.4 m) in height and generally is about 18 to 24 inches (46 to 61 cm) in width. The leaf is a simple angiosperm leaf, arranged oppositely on the stem. Each leaf is sessile (attaching directly to the plant), and about 1.4 to 3 inches (3.6 to 7.6 cm) in length. The leaves are glabrous (smooth) and acuminate in shape, with entire (smooth) edges. The veins in the leaves are pinnate.\nThe plant terminates in a dichotomous cyme, with a peduncle supporting each flower. The floral leaves are bifid (split in two parts) and ovate, while the involucral bracts are bright red, irregularly acuminate in shape (e.g., like a slipper), and about 0.043 to 0.051 inches (1.1 to 1.3 mm) in length with a long, thin tube. The flower is void of scent. The male pedicel is hairy, while the female is glabrous. The seed pod is about 0.30 inches (7.6 mm) long and 0.35 inches (8.9 mm) wide, and ovoid in shape (with truncated ends).\"",
        "Utility": "It is primarily used as an outdoor garden border plant. The root is known to be a powerful emetic. A proteolytic enzyme known as pedilanthain can be extracted from the plant's latex, and has been shown in experiments to be effective against intestinal worms and to reduce inflammation when ingested. In folk medicine, tea has been brewed from the leaves which has been used to treat asthma, persistent coughing, laryngitis, mouth ulcers, and venereal disease.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 104,
        "Scientific_Name": "Solanum melongena L.",
        "Common_Name": "Brinjal, Eggplant",
        "Family": "Solanaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Lobate",
        "Leaf_Division": "Simple",
        "Description": "The eggplant is a delicate, tropical perennial often cultivated as a tender or half-hardy annual in temperate climates. The stem is often spiny. The flower is white to purple, with a five-lobed corolla and yellow stamens. The egg-shaped, glossy, purple fruit has white flesh with a meaty texture. The cut surface of the flesh rapidly turns brown when the fruit is cut open.\n\nIt grows 40 to 150 cm (1.3 to 4.9 ft) tall, with large, coarsely lobed leaves that are 10 to 20 cm (3.9 to 7.9 in) long and 5 to 10 cm (2.0 to 3.9 in) broad. Semiwild types can grow much larger, to 225 cm (7.38 ft) with large leaves over 30 cm (12 in) long and 15 cm (5.9 in) broad. On wild plants, the fruit is less than 3 cm (1.2 in) in diameter, but much larger in cultivated forms: 30 cm (12 in) or more in length.\n\nBotanically classified as a berry, the fruit contains numerous small, soft seeds that, though edible, taste bitter because they contain nicotinoid alkaloids like the related tobacco.",
        "Utility": "The raw fruit can have a somewhat bitter taste, or even an astringent quality, but becomes tender when cooked and develops a rich, complex flavor. The fruit is capable of absorbing large amounts of cooking fats and sauces, making for very rich dishes, but salting reduces the amount of oil absorbed. Many recipes advise salting, rinsing, and draining the sliced fruit (a process known as \"degorging\") to soften it and to reduce the amount of fat absorbed during cooking, but mainly to remove the bitterness of the earlier cultivars. Some modern cultivars—including large purple ones commonly imported into western Europe—do not need this treatment.\n\nEggplant is used in the cuisines of many countries. Due to its texture and bulk, it is sometimes used as a meat substitute in vegan and vegetarian cuisines. The fruit flesh is smooth, as in the related tomato. The numerous seeds are soft and edible along with the rest of the fruit. The thin skin is also edible.",
        "Common_diseases_and_Pests": "Whiteflies"
      },
      {
        "Id": 105,
        "Scientific_Name": "Cassia javanica L.",
        "Common_Name": "Java cassia, pink shower, apple blossom tree, rainbow shower tree",
        "Family": "Fabaceae",
        "Leaf_Shape": "Elliptical",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Compound",
        "Description": "C. javanica is a fast growing, deciduous / semi-deciduous tree which flowers in spring and sheds its leaves in the winter months. It has a straight trunk that reaches heights of 25 - 40m. The leaves are paripinnate with 12 pairs of elliptical leaves. The flowers range in colour from pale pink to crimson with yellow coloured stamens and are found in open clusters. The ground under the tree is covered with a beautiful carpet of pink towards the end of the flowering season. The fruit are housed in long cylindrical dark brown pods. Because of its beauty and suitable size C. javanica is planted as a shade and ornamental tree on streets and in parks. C. javanica is polymorphic and several sub species such as those listed below exist.",
        "Utility": "It is used medicinally as a substitute to Cassia Fistula for treating constipation, colic, chlorosis and urinary disorders. Its leaves are effective against herpes simplex and the bark of C. javanica is one of the ingredients in ayurvedic and other traditional medicine antidiabetic formulations. C. javanica yields a lightweight to heavy hardwood that is used for general construction, furniture and cabinet making. The bark of C. javanica is used for tanning in the leather processing industry.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 106,
        "Scientific_Name": "Thespesia populnea (L.) Sol. ex Corrêa",
        "Common_Name": "Indian tulip tree, Pacific rosewood, Portia tree",
        "Family": "Malvaceae",
        "Leaf_Shape": "Cordate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "The Portia tree reaches a height of 6–10 m (20–33 ft) tall and a trunk diameter of 20–30 cm (7.9–11.8 in). It grows at elevations from sea level to 275 m (902 ft) in areas that receive 500–1,600 mm (20–63 in) of annual rainfall. The Portia tree is able to grow in the wide range of soil types that may be present in coastal environments, including soils derived from quartz (sand), limestone, and basalt; it favours neutral soils",
        "Utility": "The heartwood of the Portia tree is used to make the thavil, a Carnatic musical instrument of South India. In Tahiti, Milo wood is used in the making of the to'ere (slotted wooden drum), used in traditional Tahitian tribal drumming.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 107,
        "Scientific_Name": "Lantana camara L.",
        "Common_Name": "big-sage, wild-sage, red-sage, white-sage, tickberry, Lantana",
        "Family": "Verbenaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Dentate",
        "Leaf_Division": "Simple",
        "Description": "Lantana camara is a small perennial shrub which can grow to around 2 m tall and form dense thickets in a variety of environments. The leaves are broadly ovate, opposite, and simple and have a strong odour when crushed. Lantana camara has small tubular shaped flowers which each have four petals and are arranged in clusters in terminal areas stems. Flowers come in many different colours including red, yellow, white, pink and orange which differ depending on location in inflorescences, age, and maturity. The fruit of L. camara is a berry-like drupe which turns from green to dark purple when mature.",
        "Utility": "Lantana camara stalks have been used in the construction of furniture, such as chairs and tables; however, the main uses have historically been medicinal and ornamental. It is used as an ornamental plant. In many places where the plant is non-native, it is deemed as an invasive species.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 108,
        "Scientific_Name": "Musa × paradisiaca",
        "Common_Name": "Banana",
        "Family": "Musaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "\"Almost all cultivated plantains and many cultivated bananas are triploid cultivars of M. × paradisiaca. It is believed that Southeast Asian farmers first domesticated M. acuminata. When the cultivated plants spread north-west into areas where M. balbisiana was native (see map), hybrids between the two species occurred and were then developed further into a wide range of cultivars. \nHundreds of cultivars of M. × paradisiaca are known, possessing characteristics that are highly variable, but broadly intermediate between the ancestral species. They are typically 2–9 metres (7–30 ft) tall when mature. The above-ground part of the plant is a \"\"false stem\"\" or pseudostem, consisting of leaves and their fused bases. Each pseudostem can produce a single flowering stem. After fruiting, the pseudostem dies, but offshoots may develop from the base of the plant. Cultivars of M. × paradisiaca are usually sterile, without seeds or viable pollen.\"",
        "Utility": "Depending upon cultivar and ripeness, the flesh can vary in taste from starchy to sweet, and texture from firm to mushy. Both the skin and inner part can be eaten raw or cooked. Banana leaves are large, flexible, and waterproof. They are often used as ecologically friendly disposable food containers or as \"plates\" in South Asia and several Southeast Asian countries.  Each part of this plant is used in one way or the other for human purposes.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 109,
        "Scientific_Name": "Cascabela thevetia (L.) Lippold",
        "Common_Name": "Yellow oleander, Lucky nut",
        "Family": "Apocynaceae",
        "Leaf_Shape": "Lanceolate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "\"Cascabela thevetia is an evergreen tropical shrub or small tree. Its leaves are willow-like, linear-lanceolate, and glossy green in color. They are covered in waxy coating to reduce water loss (typical of oleanders). Its stem is green turning silver/gray as it ages.\nFlowers bloom from summer to fall. The long funnel-shaped sometimes-fragrant yellow (less commonly apricot, sometimes white) flowers are in few-flowered terminal clusters. Its fruit is deep red-black in color encasing a large seed that bears some resemblance to a 'Chinese lucky nut.\"",
        "Utility": "Cascabela thevetia is cultivated as an ornamental plant, and planted as large flowering shrub or small ornamental tree standards in gardens and parks in temperate climates. In frost prone areas it is container plant, in the winter season brought inside a greenhouse or as a house plant. It tolerates most soils and is drought tolerant.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 110,
        "Scientific_Name": "Bambusa bambos (L.) Voss",
        "Common_Name": "Indian thorny bamboo, spiny bamboo, thorny bamboo",
        "Family": "Poaceae",
        "Leaf_Shape": "Lanceolate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "\"Culms are not straight, but are armed with stout, curved spines. They are bright green, becoming brownish green when drying, and the young shoots are deep purple. Branches spread out from the base. Aerial roots reach up to few nodes above. Internode length is 15–46 cm, and diameter is 3.0–20 cm. Culm walls are 2.5–5.0 cm thick. Nodes are prominent and rootstock is stout.\n\nCulm sheaths are dark brown when mature, elongated, and cylindrical. Length of the sheath proper is 15–25 cm and 12–30 cm in width. Blade length is 4.0–12 cm. Auricles are not prominent. Upper surfaces of the sheath are covered with blackish-brown hairs. Lower surfaces of the sheath are not hairy. Sheaths fall early.\"",
        "Utility": "They are extensively used in many applications, mainly for making bridges and for ladders. Leaves are used for thatching. Apart from this, it has many medicinal uses.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 111,
        "Scientific_Name": "Euphorbia trigona Mill.",
        "Common_Name": "African milk tree, Cathedral cactus, Abyssinian euphorbia, High chaparall",
        "Family": "Euphorbiaceae",
        "Leaf_Shape": "Spatulate",
        "Leaf_margin_edge": "Entire",
        "Leaf_Division": "Simple",
        "Description": "Euphorbia trigona has an upright stem and number of branches that also grow upward. The stem and branches can have two or three sides. The stem itself is dark green with V-shaped light green patterns. The about 5mm long thorns are placed in pairs of two on the stem's ridges. The drop shaped leaves grow from between the two thorns on each ridge. The plant has never been known to flower, and is possibly a hybrid. As with many other Euphorbia species, the latex from the plant is poisonous and can cause skin irritations. The trigona can withstand brief cold temperatures of up to -3 degrees. It prefers sandy soil but can withstand most types of well-drained soil. It can root easily from stem cuttings, if allowed to dry for 3–7 days before planting so that it can form a callus and not rot. It grows from 1.5 – 3 meters. It is a pest-free plant. A problem that some trigonas face is that they are susceptible to falling over when fully grown because of their shallow and small root system",
        "Utility": "The plant is only known in human cultivation and is commonly used as a house plant. It is used as a ritual plant and a hedge in Gabon.",
        "Common_diseases_and_Pests": "Unknown"
      },
      {
        "Id": 112,
        "Scientific_Name": "Amaranthus retroflexus L.",
        "Common_Name": "Thotakura, red-root amaranth, redroot pigweed, red-rooted pigweed, common amaranth, pigweed amaranth, common tumbleweed",
        "Family": "Amaranthaceae",
        "Leaf_Shape": "Ovate",
        "Leaf_margin_edge": "Serrate",
        "Leaf_Division": "Simple",
        "Description": "Amaranthus retroflexus, true to one of its common names, forms a tumbleweed. It is native to the tropical Americas, but is widespread as an introduced species on most continents in a great number of habitats. This is an erect, annual herb reaching a maximum height near 3 m (9.8 ft). The leaves are nearly 15 cm (5.9 in) long on large individuals, the ones higher on the stem having a lance shape and those lower on the plant diamond or oval in shape. The plant is monoecious, with individuals bearing both male and female flowers. The inflorescence is a large, dense cluster of flowers interspersed with spiny green bracts. The fruit is a capsule less than 2 mm (0.079 in) long with a \"lid\" which opens to reveal a tiny black seed. Another of A. retroflexus's common names is pigweed because it grows where hogs are pasture-fed.",
        "Utility": "\"This plant is eaten as a vegetable in different places of the world. No species of genus Amaranthus is known to be poisonous, but the leaves contain oxalic acid and may contain nitrates if grown in nitrate-rich soils, so the water should be discarded after boiling.\nA. retroflexus was used for a multitude of food and medicinal purposes by many Native American groups. It is among the species consumed as a vegetable in Mexican markets as Quelite quintonil.\nIt is used in the Indian state of Kerala to prepare a popular dish known as thoran by combining the finely cut leaves with grated coconut, chili peppers, garlic, turmeric and other ingredients.\nThe seeds are edible raw or toasted, and can be ground into flour and used for bread, hot cereal, or as a thickener.\"",
        "Common_diseases_and_Pests": "Unknown"
      }
    ]
  }
}